<?php
$product_insects = array(
    'name_product' => 'แมลง',
    'part_file' => './assets/image/product_insects/',
    'image_product' => 'header_img_product_insects.png',
    'count_item' => 37,
    'product_item' => 'insect',

);

$product_weeds = array(
    'name_product' => 'วัชพืช',
    'part_file' => './assets/image/product_weeds/',
    'image_product' => 'header_img_product_weeds.png',
    'count_item' => 11,
    'product_item' => 'weed',

);

$product_supplements = array(
    'name_product' => 'สารเสริม',
    'part_file' => './assets/image/product_supplements/',
    'image_product' => 'header_img_product_supplements.png',
    'count_item' => 8,
    'product_item' => 'supplement',

);
$product_hormones = array(
    'name_product' => 'ฮอร์โมน',
    'part_file' => './assets/image/product_hormones/',
    'image_product' => 'header_img_product_hormones.png',
    'count_item' => 3,
    'product_item' => 'hormone',

);
$product_plantDiseases = array(
    'name_product' => 'โรคพืช',
    'part_file' => './assets/image/product_PlantDiseases/',
    'image_product' => 'header_img_product_plantDiseases.png',
    'count_item' => 9,
    'product_item' => 'plantDisease',

);
// แบ่งกลุ่ม แมลง23กลุ่ม
// กลุ่ม 1

$g1_group = '6';
$g1_group_name = 'Avermectin';
$g1_common_name = 'อะบาเม็กติน 1.8% W/V EC (Abamectin)';
$g1_substance_characteristics = 'สีดําใส';
$g1_packing_size = '1000 มิลลิลิตร';
$g1_usage_rate = 'อัตราการใช้งาน 20 - 30 ซีซี ต่อน้ํา 20 ลิตร';
$g1_feature = 'เป็นสารในกลุ่ม avermectins มีคุณสมบัติถูกตัวตาย กินตาย และแทรกซึม เข้าสู่ใบ กลไกออกฤทธิ์ต่อระบบประสาทและกล้ามเนื้อ ตรงบริเวณช่องว่าง ระหว่างเซลล์ประสาทกับกล้ามเนื้อ โดยกระตุ้นสารกลูตาเมทจับกับช่องผ่าน กลูตาเมทคลอไรด์ตรงตําแหน่งแอลโลสเทอริก ทําให้คลอไรด์ไอออนไหลเข้า เซลล์ประสาทเป็นจํานวนมากเกิดการยับยั้งกระแสประสาททําให้แมลงอัมพาต และตาย เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล (broad-spectrum) ใช้กําจัดแมลงปากดูด ปากกัด, ไส้เดือนฝอย, ไร, เป็นต้น';
$g1_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น แมลงหวี่ขาว, เพลี้ย, จักจั่น, ไรแดง, เพลี้ยฝอย, หนอนใบขาว, หนอนกอ, หนอน, หนอนเจาะ, ผ่าดอก';
// กลุ่ม 2

$g2_group = '6';
$g2_group_name = 'Avermectin';
$g2_common_name = 'อะบาเม็กติน 1.8% W/V EC (Abamectin)';
$g2_substance_characteristics = 'สีดําข้น';
$g2_packing_size = '1000 มิลลิลิตร';
$g2_usage_rate = 'อัตราการใช้งาน 20 - 30 ซีซี ต่อน้ํา 20 ลิตร';
$g2_feature = 'เป็นสารในกลุ่ม avermectins มีคุณสมบัติถูกตัวตาย กินตาย และแทรกซึม เข้าสู่ใบ กลไกออกฤทธิ์ต่อระบบประสาทและกล้ามเนื้อ ตรงบริเวณช่องว่างระหว่างเซลล์ประสาทกับกล้ามเนื้อ โดยกระตุ้นสารกลูตาเมทจับกับช่องผ่าน กลูตาเมทคลอไรด์ตรงตําแหน่งแอลโลสเทอริก ทําให้คลอไรด์ไอออนไหลเข้าเซลล์ประสาทเป็นจํานวนมากเกิดการยับยั้งกระแสประสาททําให้แมลงอัมพาต และตาย เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล (broad-spectrum) ใช้กําจัดแมลงปากดูด ปากกัด, ไส้เดือนฝอย, ไร, เป็นต้น';
$g2_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น แมลงหวี่ขาว, เพลี้ย, จักจั่น, ไรแดง, เพลี้ยฝอย, หนอนใบขาว, หนอนกอ, หนอน, หนอนเจาะ, ผ่าดอก';
// กลุ่ม 3

$g3_group = '6';
$g3_group_name = 'Avermectin';
$g3_common_name = 'Emamectin benzoate 1.92% W/V EC';
$g3_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g3_packing_size = '1000 มิลลิลิตร';
$g3_usage_rate = '20-30 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g3_feature = 'เป็นสารในกลุ่ม avermectins มีคุณสมบัติถูกตัวตาย กินตาย และแทรกซึม เข้าสู่ใบ กลไกออกฤทธิ์ต่อระบบประสาทและกล้ามเนื้อ ตรงบริเวณช่องว่างระหว่างเซลล์ประสาทกับกล้ามเนื้อ โดยกระตุ้นสารกลูตาเมทจับกับช่องผ่าน กลูตาเมทคลอไรด์ตรงตําแหน่งแอลโลสเทอริก ทําให้คลอไรด์ไอออนไหลเข้าเซลล์ประสาทเป็นจํานวนมากเกิดการยับยั้งกระแสประสาททําให้แมลงอัมพาต และตาย เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล (broad-spectrum) ใช้กําจัดแมลงปากดูด ปากกัด, ไส้เดือนฝอย, ไร, เป็นต้น';
$g3_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น แมลงหวี่ขาว, เพลี้ย, จักจั่น, ไรแดง, เพลี้ยฝอย, หนอนใบขาว, หนอนกอ, หนอน, หนอนเจาะ, ผ่าดอก';
// กลุ่ม 4

$g4_group = '3A';
$g4_group_name = 'Pyrethroid';
$g4_common_name = 'ไซเพอร์เมทริน (cypermethrin) 35% W/V EC';
$g4_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g4_packing_size = '1000 มิลลิลิตร';
$g4_usage_rate = '20-30 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g4_feature = 'เป็นสารในกลุ่ม synthetic pyrethroids มีคุณสมบัติถูกตัวตาย และกินตาย ออกฤทธิ์เร็ว โดยเฉพาะในสภาพอากาศร้อนและแดดจัด มีคุณสมบัติเป็นยาน็อคแมลง กลไกออกฤทธิ์ต่อระบบประสาทของแมลงบริเวณแกนประสาท โดยปรับการปิดของช่องผ่าน Voltage-gated sodium channels ที่บริเวณผิว axon ให้ช้าลงกว่าปกติ เกิดการส่งกระแสประสาทยาวนานผิดปกติ และเสียสมดุลโซเดียมไอออน เกิดอาการกระตุก หดเกร็งของกล้ามเนื้อ เป็นตะคริวรุนแรงเฉียบพลัน เป็นอัมพาตและตายอย่างรวดเร็ว';
$g4_benefit = 'ใช้กําจัดแมลง เช่น เพลี้ยไฟ, เพลี้ยอ่อน, แมลงหล่า, มวนดําถั่ว, มวนเที่ยวถั่ว, มวนเขียวส้ม, มวนลําไย, มวนแดงฝ้าย, แมลงสิง, ด้วงงวงกัดใบมะม่วง, แมลงค่อมทอง, ด้วงเต่าแตง, ด้วงน้ํามัน, หนอนคืบละหุ่ง, หนอนคืบกะหล่ํา, หนอนเจาะฝักถั่ว, หนอนกินใบลําไย, หนอนบุ้งชนิดต่างๆ, หนอนชอนใบ เป็นต้น';
// กลุ่ม 5

$g5_group = '3A';
$g5_group_name = 'Pyrethroid';
$g5_common_name = 'ไซเพอร์เมทริน (cypermethrin) 10% W/V EC';
$g5_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g5_packing_size = '1000 มิลลิลิตร';
$g5_usage_rate = '20-30 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g5_feature = 'เป็นสารในกลุ่ม synthetic pyrethroids มีคุณสมบัติถูกตัวตาย และกินตาย ออกฤทธิ์เร็ว โดยเฉพาะในสภาพอากาศร้อนและแดดจัด มีคุณสมบัติเป็นยาน็อคแมลง กลไกออกฤทธิ์ต่อระบบประสาทของแมลง บริเวณแกนประสาท โดยปรับการปิดของช่องผ่าน Voltage-gated sodium channels ที่บริเวณผิว axon ให้ช้าลงกว่าปกติ เกิดการส่งกระแสประสาทยาวนานผิดปกติ และเสียสมดุลโซเดียมไอออน เกิดอาการกระตุก หดเกร็งของกล้ามเนื้อ เป็นตะคริวรุนแรงเฉียบพลัน เป็นอัมพาตและตายอย่างรวดเร็ว';
$g5_benefit = 'ใช้กําจัดแมลง เช่น เพลี้ยไฟ, เพลี้ยอ่อน, แมลงหล่า, มวนดําถั่ว, มวนเที่ยวถั่ว, มวนเขียวส้ม, มวนลําไย, มวนแดงฝ้าย, แมลงสิง, ด้วงงวงกัดใบมะม่วง, แมลงค่อมทอง, ด้วงเต่าแตง, ด้วงน้ํามัน, หนอนคืบละหุ่ง, หนอนคืบกะหล่ํา, หนอนเจาะฝักถั่ว, หนอนกินใบลําไย, หนอนบุ้งชนิดต่างๆ, หนอนชอนใบ เป็นต้น';
// กลุ่ม 6

$g6_group = '2B';
$g6_group_name = 'phenylpyrazoles';
$g6_common_name = 'ฟิโพรนิล 5% (fipronil) 5% W/ SC';
$g6_substance_characteristics = 'ของเหลวสีขาวขุ่นข้น';
$g6_packing_size = '1000 มิลลิลิตร';
$g6_usage_rate = '20-50 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g6_feature = 'เป็นสารกลุ่ม phenylpyrazoles มีคุณสมบัติถูกตัวตาย กินตายและแทรกซึมผ่านทางปาก การเคลื่อนย้ายของสารในพืชจํากัดเฉพาะในพืชวงศ์หญ้า เช่น ข้าว ข้าวโพด อ้อย กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาทโดยขัดขวางการทํางานของช่องผ่าน GABA-gated chloride channels และช่องผ่าน Glutamate-gated chloride channels ทําให้สารสื่อประสาท GABA และ Glutamates ไม่สามารถนําส่งไอออนคลอไรด์ผ่านช่องทางทั้ง 2 เพื่อลดละระดับกระแสประสาทและรักษาสมดุลไอออน และเป็นผลให้ส่งกระแสประสาทมากผิดปกติ เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล ประเภท broad-spectrum ใช้กําจัดแมลงปากดูด ปากกัด ไร มด ปลวก เห็บ หมัด ตะขาบ ไส้เดือนฝอย เป็นต้น';
$g6_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ, เพลี้ยกระโดด, เพลี้ยจักจั่น, เพลี้ยอ่อน, หนอนห่อใบข้าว, หนอนม้วนใบถั่ว, หนอนม้วนใบทุเรียน, หนอนประกบใบส้ม, หนอนชอนใบส้ม, หนอนด้วงกัดราก, ด้วงหมัดผัก, ปลวก, ด้วงงวงกัดใบมะม่วง, ด้วงงวงเจาะยอด, ด้วงเต่าแตง, ด้วงน้ํามัน, ด้วงแรด, ไส้เดือนฝอย, มวนลําไย, มอดเจาะลําต้น, แมลงค่อมทอง, มด, เป็นต้น';
// กลุ่ม 7

$g7_group = '2B';
$g7_group_name = 'phenylpyrazoles';
$g7_common_name = 'ฟิโพรนิล 10% (fipronil) 10% W/V SC';
$g7_substance_characteristics = 'ของเหลวสีขาวขุ่นข้น';
$g7_packing_size = '1000 มิลลิลิตร';
$g7_usage_rate = '20-50 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g7_feature = 'เป็นสารกลุ่ม phenylpyrazoles มีคุณสมบัติถูกตัวตาย กินตายและแทรกซึมผ่านทางปาก การเคลื่อนย้ายของสารในพืชจํากัดเฉพาะในพืชวงศ์หญ้า เช่น ข้าว ข้าวโพด อ้อย กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาทโดยขัดขวางการทํางานของช่องผ่าน GABA-gated chloride channels และช่องผ่าน Glutamate-gated chloride channels ทําให้สารสื่อประสาท GABA และ Glutamates ไม่สามารถนําส่งไอออนคลอไรด์ผ่านช่องทางทั้ง 2 เพื่อลดละระดับกระแสประสาทและรักษาสมดุลไอออน และเป็นผลให้ส่งกระแสประสาทมากผิดปกติ เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล ประเภท broad-spectrum ใช้กําจัดแมลงปากดูด ปากกัด ไร มด ปลวก เห็บ หมัด ตะขาบ ไส้เดือนฝอย เป็นต้น';
$g7_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ, เพลี้ยกระโดด, เพลี้ยจักจั่น, เพลี้ยอ่อน, หนอนห่อใบข้าว, หนอนม้วนใบถั่ว, หนอนม้วนใบทุเรียน, หนอนประกบใบส้ม, หนอนชอนใบส้ม, หนอนด้วงกัดราก, ด้วงหมัดผัก, ปลวก, ด้วงงวงกัดใบมะม่วง, ด้วงงวงเจาะยอด, ด้วงเต่าแตง, ด้วงน้ํามัน, ด้วงแรด, ไส้เดือนฝอย, มวนลําไย, มอดเจาะลําต้น, แมลงค่อมทอง, มด, เป็นต้น';
// กลุ่ม 8

$g8_group = '3A';
$g8_group_name = 'Pyrethroid';
$g8_common_name = 'แลมบ์ดา-ไซฮาโลทริน (lambda-cyhalothrin) 2.5 % W/V EC';
$g8_substance_characteristics = 'ของเหลวใสสีเหลืองอ่อน';
$g8_packing_size = '1000 มิลลิลิตร';
$g8_usage_rate = '20-40 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g8_feature = 'เป็นสารในกลุ่ม synthetic pyrethroids มีคุณสมบัติถูกตัวตาย และกินตาย ออกฤทธิ์เร็ว โดยเฉพาะในสภาพอากาศร้อนและแดดจัด มีคุณสมบัติเป็นยาน็อคแมลง กลไกออกฤทธิ์ต่อระบบประสาทของแมลงบริเวณแกนประสาท โดยปรับการปิดของช่องผ่าน Voltage-gated sodium channels ที่บริเวณผิว axon ให้ช้าลงกว่าปกติ เกิดการส่งกระแสประสาทยาวนานผิดปกติ และเสียสมดุลโซเดียมไอออน เกิดอาการกระตุก หดเกร็งของกล้ามเนื้อ เป็นตะคริวรุนแรงเฉียบพลัน เป็นอัมพาตและตายอย่างรวดเร็ว';
$g8_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น หนอนห่อใบข้าว หนอนกระทู้ เพลี้ยไฟ เพลี้ยอ่อน แมลงหล่า มวนดําถั่ว มวนเขียว มวนลําไย มวนแดงฝ้าย แมลงสิง ด้วงงวงกัดใบ แมลงค่อมทอง ด้วงเต่าแตง ด้วงน้ํามัน หนอนคืบละหุ่ง หนอนคืบกะหล่ํา หนอนเจาะฝักถั่ว หนอนกินใบลําไย หนอนบุ้ง หนอนชอนใบ เป็นต้น';
// กลุ่ม 9

$g9_group = '3A';
$g9_group_name = 'Pyrethroid';
$g9_common_name = 'แลมบ์ดา-ไซฮาโลทริน (lambda-cyhalothrin) 5 % W/V EC';
$g9_substance_characteristics = 'ของเหลวใสสีเหลืองอ่อน';
$g9_packing_size = '1000 มิลลิลิตร';
$g9_usage_rate = '20-40 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g9_feature = 'เป็นสารในกลุ่ม synthetic pyrethroids มีคุณสมบัติถูกตัวตาย และกินตาย ออกฤทธิ์เร็ว โดยเฉพาะในสภาพอากาศร้อนและแดดจัด มีคุณสมบัติเป็นยาน็อคแมลง กลไกออกฤทธิ์ต่อระบบประสาทของแมลงบริเวณแกนประสาท โดยปรับการปิดของช่องผ่าน Voltage-gated sodium channels ที่บริเวณผิว axon ให้ช้าลงกว่าปกติ เกิดการส่งกระแสประสาทยาวนานผิดปกติ และเสียสมดุลโซเดียมไอออน เกิดอาการกระตุก หดเกร็งของกล้ามเนื้อ เป็นตะคริวรุนแรงเฉียบพลัน เป็นอัมพาตและตายอย่างรวดเร็ว';
$g9_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น หนอนห่อใบข้าว หนอนกระทู้ เพลี้ยไฟ เพลี้ยอ่อน แมลงหล่า มวนดําถั่ว มวนเขียว มวนลําไย มวนแดงฝ้าย แมลงสิง ด้วงงวงกัดใบ แมลงค่อมทอง ด้วงเต่าแตง ด้วงน้ํามัน หนอนคืบละหุ่ง หนอนคืบกะหล่ํา หนอนเจาะฝักถั่ว หนอนกินใบลําไย หนอนบุ้ง หนอนชอนใบ เป็นต้น';
// กลุ่ม 10

$g10_group = '4A';
$g10_group_name = 'neonicotinoids';
$g10_common_name = 'อิมิดาโคลพริด (imidachlorpid) 10% W/V SL';
$g10_substance_characteristics = 'ของเหลวใสสีเหลือง';
$g10_packing_size = '1000 มิลลิลิตร';
$g10_usage_rate = ' 20-40 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g10_feature = 'เป็นสารในกลุ่ม neonicotinoids มีคุณสมบัติถูกตัวตาย กินตาย แทรกซึมผ่านใบและดูดซึม นอกจากนี้ยังดูดซึมทางรากหรือท่อน้ําและเคลื่อนย้ายในท่อน้ําจากล่างขึ้นบน กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาท โดยแย่งหรือแข่งกับสารสื่อประสาท Acetylcholines ในการจับกับตัวรับ nicotinic acetylcholine receptors ทําให้ส่งกระแสประสาทมากกว่าปกติและต่อมาตัวรับจะผิดรูปและทํางานไม่ได้';
$g10_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ, เพลี้ยกระโดดสีน้ําตาล, เพลี้ยจั๊กจั่นฝอย, เพลี้ยจั๊กจั่นฝ้าย, มวนเขียวข้าว, เพลี้ยอ่อน, มวนลําไย, แมลงสิง, แมลงหล่า, หนอนชอนใบส้ม, ปลวก เป็นต้น';
// กลุ่ม 11

$g11_group = '6';
$g11_group_name = 'Avermectin';
$g11_common_name = 'อีมาเมกตินเบนโซเอต (emamectin benzoate) 5% SG';
$g11_substance_characteristics = 'ผงสีขาวละเอียด';
$g11_packing_size = '1000 กรัม / 100 กรัม';
$g11_usage_rate = 'ใช้อัตรา 10-15 กรัม ต่อน้ํา 20 ลิตร';
$g11_feature = 'เป็นสารในกลุ่ม avermectins มีคุณสมบัติถูกตัวตาย กินตาย และแทรกซึมเข้าสู่ใบ กลไกออกฤทธิ์ต่อระบบประสาทและกล้ามเนื้อตรงบริเวณช่องว่างระหว่างเซลล์ประสาทกับกล้ามเนื้อโดยกระตุ้นสาร Glutamates จับกับช่องผ่าน Glutamate-gated chloride channels ตรงตําแหน่งตรงตําแหน่ง allosteric modulators ทําให้คลอไรด์ไอออนไหลเข้าเซลล์ประสาทเป็นจํานวนมาก เกิดการยับยั้งกระแสประสาททําให้แมลงเป็นอัมพาตและตาย เป็นสารกําจัดแมลงที่มีฤทธิ์กว้างครอบจักรวาล ประเภท broad-spectrum ใช้กําจัดแมลงปากดูด ปากกัด ไร ไส้เดือนฝอย เป็นต้น';
$g11_benefit = 'ใช้ป้องกันกําจัดแมลง เช่น เพลี้ยไฟ เพลี้ยอ่อน เพลี้ยจักจั่นฝ้าย เพลี้ยจักจั่นหนอนหัวดํามะพร้าว หนอนชอนใบ หนอนห่อใบข้าว หนอนกระทู้ข้าวโพด หนอนเจาะฝักถั่ว หนอนบุ้ง หนอนผีเสื้อ ด้วงแตงแดง ด้วงน้ํามัน ด้วงงวงกรีดใบมะม่วง แมลงค่อมทอง มวนชนิดต่าง ๆ เป็นต้น';
// กลุ่ม 12

$g12_group = '4A';
$g12_group_name = 'neonicotinoids';
$g12_common_name = 'อิมิดาโคลพริด (imidacloprid) 70% WG';
$g12_substance_characteristics = 'เม็ดสีน้ําตาล';
$g12_packing_size = '1000 กรัม / 100 กรัม /500 กรัม';
$g12_usage_rate = ' - พ่นทางใบ ใช้อัตรา 10-20 กรัม ต่อน้ํา 20 ลิตร - แช่ท่อนพันธุ์มันสําปะหลังหรือจุ่มถาดเพาะกล้า ใช้อัตรา 10 กรัม ต่อน้ํา 20 ลิตร';
$g12_feature = 'เป็นสารในกลุ่ม neonicotinoids มีคุณสมบัติถูกตัวตาย กินตาย แทรกซึมผ่านใบและดูดซึม นอกจากนี้ยังดูดซึมทางรากหรือท่อน้ําและเคลื่อนย้ายในท่อน้ําจากล่างขึ้นบน กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาทโดยแย่งหรือแข่งกับสารสื่อประสาท Acetylcholines ในการจับกับตัวรับ nicotinic acetylcholine receptorsทําให้ส่งกระแสประสาทมากกว่าปกติและต่อมาตัวรับจะผิดรูปและทํางานไม่ได้';
$g12_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ, เพลี้ยอ่อน, เพลี้ยกระโดดสีน้ําตาล, เพลี้ยจั๊กจั่นฝอย, เพลี้ยหอย, เพลี้ยไก่แจ้, เพลี้ยจั๊กจั่นฝ้าย, แมลงหวี่ขาว, ด้วงเต่าแตง, มอดเจาะลําต้น, มอดชนิดต่าง ๆ, ด้วงงวง, หนอนชอนใบส้ม, หนอนประกบใบส้ม, หนอนม้วนใบเงาะ, หนอนม้วนใบถั่ว เป็นต้น';
// กลุ่ม 123

$g13_group = '1B';
$g13_group_name = 'Organophosphates';
$g13_common_name = 'โพรฟีโนฟอส (profenofos) 50% W/V EC';
$g13_substance_characteristics = 'ของเหลวสีส้มแดง';
$g13_packing_size = '1000 มิลลิลิตร';
$g13_usage_rate = '20-40 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g13_feature = 'เป็นสารในกลุ่ม organophosphates มีคุณสมบัติถูกตัวตาย กินตาย ซึมผ่านปากใบพืชและมีกลิ่นฉุน สามารถใช้กําจัดไข่หนอนผีเสื้อ ไข่ไรศัตรูพืชและไข่แมลงชนิดอื่นที่วางไข่บนใบพืชได้ กลไกออกฤทธิ์ต่อระบบประสาท โดยยับยั้งการทํางานของเอนไซม์ Acetylcholinesterases ทําให้เกิดการคั่งของสารสื่อประสาท Acetylcholines ที่ปลายประสาท ส่งผลให้ถ่ายทอดกระแสประสาทไม่หยุดและสูงมากเกินไป';
$g13_benefit = 'ใช้ป้องกันกําจัดเพลี้ยจักจั่นฝอยทุเรียน, เพลี้ยจักจั่นช่อมะม่วง, เพลี้ยไก่แจ้ทุเรียน, เพลี้ยไฟ, เพลี้ยหอย, เพลี้ยไก่แจ้ลําไย, เพลี้ยแป้ง, หนอนชอนใบ, หนอนม้วนใบส้ม, หนอนม้วนใบถั่ว, หนอนม้วนใบทุเรียน, หนอนคืบละหุ่ง, หนอนคืบกะหล่ํา, หนอนกออ้อย, หนอนกอข้าว, ด้วงงวง, ด้วงหมัดผัก, ด้วงเจาะลําต้น เป็นต้น';
// กลุ่ม 14

$g14_group = '3';
$g14_group_name = 'Triazoles';
$g14_common_name = 'โพรคลอราซ (prochloraz) 45% W/V EC';
$g14_substance_characteristics = 'ของเหลวสีขาวขุ่น';
$g14_packing_size = '1000 มิลลิลิตร';
$g14_usage_rate = '10-20 มิลลิลิตร ต่อน้ํา 20 ลิตร';
$g14_feature = 'เป็นสารกลุ่ม triazoles มีคุณสมบัติเป็นสารดูดซึมและแทรกซึมเข้าสู่พืชได้รวดเร็ว เคลื่อนย้ายในต้นพืชได้ มีฤทธิ์ครอบคลุมเชื้อโรคกว้างขวาง ยับยั้งการสร้างและพัฒนาเส้นใยของเชื้อรา โดดเด่นในการกําจัดโรคแอนแทรคโรส และโรคใบจุด กลไกออกฤทธิ์ขัดขวางการทํางานของเอนไซม์ C14-demethylases ทําให้การสังเคราะห์สเตอรอยที่ผนังเซลล์ผิดปกติ';
$g14_benefit = 'ใช้ป้องกันกําจัดโรคพืช เช่น โรคแอนแทรคโนส, โรคใบจุด, โรคเมลาโนส, โรคดาวกระจาย, โรคสแคป, โรคผลเน่าใช้แช่ผลทุเรียนหรือไม้ผลอื่นๆ หลังการเก็บเกี่ยว อัตรา 10-15 มิลลิลิตร ต่อน้ํา 20 ลิตร';
// กลุ่ม 15

$g15_group = '12C';
$g15_group_name = 'Sulfur-bridged';
$g15_common_name = 'โพรพาร์ไกต์ (propargite) 20% W/V EC ลักษณะสาร : ของเหลวสีเหลืองใส';
$g15_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g15_packing_size = '1000 มิลลิลิตร';
$g15_usage_rate = '30-40 มิลลิลิตร ต่อน้ำ 20 ลิตร';
$g15_feature = 'เป็นสารในกลุ่ม sulfur-bridged มีคุณสมบัติถูกตัวตาย กินตายและแก๊สระเหย มีฤทธิ์คงตัวบนใบพืชได้นาน สามารถกําจัดไรได้ทั้งระยะไข่ ตัวอ่อน และตัวแก่ กลไกออกฤทธิ์ต่อระบบหายใจที่เกี่ยวข้องกับการสังเคราะห์พลังงานของไรโดยขัดขวางหรือยับยั้งการทํางานของเอนไซม์ เอทีพี (ATP Synthase) ในไมโตคอนเดีย ที่มีหน้าที่สร้างพลังงานเอทีพี ทําให้เซลล์ภายในของไรขาดพลังงานในการทํากิจกรรมต่างๆ และไรจะตายในที่สุด หมายเหตุ : มีพิษต่อปลา ปลอดภัยต่อผึ้ง, อย่าผสมร่วมกับสารอื่นที่มีฤทธิ์เป็นกรดจัด หรือด่างจัดหรือสารกําจัดศัตรูพืชที่มีตัวทําละลายเป็นปิโตรเลียมออยล์ ไวท์ออยล์ มิเนอร์รัล ออลย์ หรือน้ํามันอื่นในปริมาตรเข้มข้น, หลีกเลี่ยงพ่นขณะอากาศร้อนจัด, อาจเป็นพิษต่อสตรอเบอร์รี่ และกุหลาบ';
$g15_benefit = 'ใช้ป้องกันกําจัดไรศัตรูพืช เช่น ไรแดงแอฟริกัน ไรแดงมะม่วง ไรแดงส้ม ไรแดงมันสําปะหลัง /ไรแดงหม่อน ไรแดงชมพู่ ไรแดงชา ไรขาวพริก ไรกระเทียม ไรสนิมส้ม ไรกํามะหยี่ ไรเหลืองส้ม ไรสองจุด ไรแมงมุมค้นซาวา ไรแมงมุมเผือก ไรแมงมุมฟิจิ ไรเขียวข้าว ไรสี่ขา เป็นต้น';
// กลุ่ม 16

$g16_group = '4A';
$g16_group_name = 'Neonicotinoids';
$g16_common_name = 'อะเซทามิพริด (Acetamiprid) 3% W/V EC';
$g16_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g16_packing_size = '1000 มิลลิลิตร';
$g16_usage_rate = '1 ต่อน้ำ 20 ส่วน';
$g16_feature = 'เป็นสารในกลุ่ม neonicotinoids มีคุณสมบัติถูกตัวตาย กินตาย แทรกซึมผ่านใบและดูดซึม นอกจากนี้ยังดูดซึมทางรากหรือท่อน้ําและเคลื่อนย้ายในท่อน้ําจากล่างขึ้นบน กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาท โดยแย่งหรือแข่งกับสารสื่อประสาท Acetylcholines ในการจับกับตัวรับ nicotinic acetylcholine receptors ทําให้ส่งกระแสประสาทมากกว่าปกติและต่อมาตัวรับจะผิดรูปและทํางานไม่ได้';
$g16_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ, เพลี้ยกระโดดสีน้ําตาล, เพลี้ยจั๊กจั่นฝอย, เพลี้ยจั๊กจั่นฝ้าย, มวนเขียวข้าว, เพลี้ยอ่อน, มวนลําไย, แมลงสิง, แมลงหล่า, หนอนชอนใบส้ม, ปลวก เป็นต้น';
// กลุ่ม 17

$g17_group = 'K3';
$g17_group_name = 'Chloroacetanilide';
$g17_common_name = 'เพรทิลาคลอร์ (pretilachlor) 30% W/V EC';
$g17_substance_characteristics = 'ของเหลวสีเหลืองใส';
$g17_packing_size = '1000 มิลลิลิตร';
$g17_usage_rate = '250-300 มิลลิลิตร ผสมน้ํา 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่';
$g17_feature = 'สารกําจัดวัชพืชในนาข้าวประเภทเลือกทําลาย ในกลุ่ม chloroacetamides มีฤทธิ์ดูดซึม เข้าทําลายวัชพืชส่วนที่อยู่ใต้ดินและยอดอ่อนวัชพืชที่พึ่งงอก พ่นในขณะดินเลนหรือดินแห้งได้ เหมาะสมกับนาที่ดอนหรือผืนนาไม่เรียบเสมอ กลไกออกฤทธิ์ต่อส่วนปลายยอดอ่อนของวัชพืช ยับยั้งการสังเคราะห์กรดไขมันสายยาว ส่งผลยับยั้งการแบ่งเซลล์ส่วนปลายยอดเจริญ ทั้งวัชพืชที่โผล่พ้นดินและยังไม่โผล่พ้นดิน';
$g17_benefit = 'ใช้กําจัดวัชพืชก่อนวัชพืชงอกและใช้หลังวัชพืชงอกระยะเริ่มต้นในนาข้าวหว่านน้ําตมข้าวนาหว่านแห้งข้าวไร่ กําจัดวัชพืชประเภทใบแคบ เช่น หญ้าดอกขาว หญ้าข้าวนก หญ้าแดง หญ้านกสีชมพู ใบกว้าง เช่น ผักปอด ขาเขียด ผักปลาบ และกก เช่น หนวดปลาดุก แห้วหมู กกขนาก กกทราย กกแดง กกสามเหลี่ยม เป็นต้น';
// กลุ่ม 18

$g18_group = ' ';
$g18_group_name = 'Aliphatic hydrocarbon';
$g18_common_name = 'ไวต์ออยล์ (Petroleum oil) 67% W/V EC';
$g18_substance_characteristics = 'ของเหลวสีใส';
$g18_packing_size = '1000 มิลลิลิตร';
$g18_usage_rate = '30-40 มิลลิลิตร ผสมน้ํา 20 ลิตร';
$g18_feature = 'เป็นสารที่ทําลายแมลงทางกายภาพ (Physical poison) กลไกการออกฤทธิ์จะไปขัดขวางหรืออุดรูหายใจ (Suffocation) และดูดความชื้น (Desiccation) ในตัวแมลงทําให้แมลงตาย นอกจากนี้ยังไปชะล้างไขมันที่ผนังลําตัวของแมลงบางชนิด เช่น เพลี้ยแป้ง เพลี้ยหอย ไรแดง รวมทั้งไปเคลือบไข่ของแมลงทําให้ไข่ไม่ฟัก มีผลต่อพฤติกรรมการวางไข่ของแมลง การพ่นสารไวท์ออยล์หรือปิโตรเลียมออยล์จะทําให้พืชมีกลิ่นเปลี่ยนไป ส่งผลให้ผีเสื้อเพศเมียวางไข่น้อยลง เช่น กรณีของแมลงวันทองพริก ลดการวางไข่เนื่องจากผิวของผลพริกเคลือบด้วยไขมัน ทําให้การลดการทําลายของแมลงวันทองในพริกได้ ใช้ในลักษณะของสารเสริมประสิทธิภาพ (Adjuvants) จากการวิจัยพบว่าการใช้สารกลุ่มนีโอนิโคตินอยด์ (อิมิดาโคลพริด ไทอะมีโทแซม โคลไทอะนิดิน ไดโนทีฟูแรน) ผสมกับไวท์ออยล์ มีประสิทธิภาพเพิ่มขึ้นในการป้องกันกําจัดเพลี้ยกระโดดสีน้ําตาล เพลี้ยแป้งในน้อยหน่า เพลี้ยแป้งในมันสําปะหลัง แมลงหวี่ขาวในผักชีฝรั่ง แมลงหวี่ขาวในกะเพรา เพลี้ยไฟในโหระพา โดยสารในกลุ่มน้ํามันจะช่วยเสริมหรือเพิ่มฤทธิ์ของสารป้องกันกําจัดศัตรูพืช ส่งเสริมให้สารเกาะยึดติด หรือกระจายตัว และแทรกซึมผ่านชั้นไขมันของใบพืชโดยเฉพาะการใช้สารที่ออกฤทธิ์ดูดซึม นอกจากนี้มีรายงานว่าสารกลุ่มน้ํามันจะช่วยยืดอายุทําให้สารป้องกันกําจัดศัตรูพืชอยู่ได้นานขึ้น เนื่องจากจะช่วยชะลอการระเหยตัว ป้องกันแสงแดด และป้องกันการชะล้างจากฝน';
$g18_benefit = 'อุดรูหายใจและดูดความชื้น ในตัวแมลงทําให้แมลงตาย ชะล้างไขมันที่ผนังลําตัวของแมลงบางชนิด เช่น เพลี้ยแป้ง เพลี้ยหอย ไรแดง เคลือบไข่ของแมลงทําให้ไข่ไม่ฟัก การพ่นสารไวท์ออยล์จะทําให้พืชมีกลิ่นเปลี่ยนไป ส่งผลให้ผีเสื้อเพศเมียวางไข่น้อยลง เสริมหรือเพิ่มฤทธิ์ของสารป้องกันกําจัดศัตรูพืช ส่งเสริมให้สารเกาะยึดติดหรือกระจายตัว แทรกซึมผ่านชั้นไขมันของใบพืชโดยเฉพาะการใช้สารที่ออกฤทธิ์ดูดซึม ทําให้สารป้องกันกําจัดศัตรูพืช อยู่ได้นานขึ้น เนื่องจากจะช่วยชะลอการระเหยตัว ป้องกันแสงแดด และป้องกันการชะล้างจากฝนป้องกันกําจัดแมลง เพลี้ยอ่อน เพลี้ยไฟ เพลี้ยหอย เพลี้ยแป้ง เพลี้ยไก่แจ้ส้ม หนอนชอนใบส้ม รวมทั้งไรแดงในส้ม และทุเรียน ฯลฯป้องกันกําจัดโรคพืชบางชนิดได้ โรคราแป้ง โรคราดํา เป็นต้น';
// กลุ่ม 19

$g19_group = '3A';
$g19_group_name = 'Pyrethroid';
$g19_common_name = 'ไบเฟนทริน (Bifenthrin) 10% W/V EC';
$g19_substance_characteristics = 'ของเหลวส้มใส';
$g19_packing_size = '1000 มิลลิลิตร';
$g19_usage_rate = '250-300cc ต่อน้ํา 200 ลิตร';
$g19_feature = 'เป็นสารในกลุ่ม synthetic pyrethroids มีคุณสมบัติถูกตัวตาย และกินตาย ออกฤทธิ์เร็ว โดยเฉพาะในสภาพอากาศร้อนและแดดจัด มีคุณสมบัติเป็นยาน็อคแมลง กลไกออกฤทธิ์ต่อระบบประสาทของแมลงบริเวณแกนประสาท โดยปรับการปิดของช่องผ่าน Voltage-gated sodium channels ที่บริเวณผิว axon ให้ช้าลงกว่าปกติ เกิดการส่งกระแสประสาทยาวนานผิดปกติ และเสียสมดุลโซเดียมไอออน เกิดอาการกระตุก หดเกร็งของกล้ามเนื้อ เป็นตะคริวรุนแรงเฉียบพลัน เป็นอัมพาตและตายอย่างรวดเร็ว';
$g19_benefit = 'ใช้ป้องกันกําจัด แมลงบั่ว แมลงสิง แมลงหวี่ขาว แมลงวันทอง แมลงหล่า แมลงกระเบื้อง แมลงบินทุกชนิด แมลงใต้ดิน ผีเสื้อกลางคืน ไรแดง เพลี้ยไฟ เพลี้ยอ่อน เพลี้ยไก่แจ้ เพลี้ยกระโดด เพลี้ยจั่กจั่น หนอนกอ หนอนเจาะ หนอนใย หนอนหนังเหนียว ด้วงหมัดผัก ด้วงปีกแข็ง ปลวก มด ยุง เป็นต้น';
// กลุ่ม 20

$g20_group = '9B';
$g20_group_name = 'Pyridine Azomethines';
$g20_common_name = 'ไพมีโทรซีน (pymetrozine) 50% WG';
$g20_substance_characteristics = 'เม็ดสีขาว';
$g20_packing_size = '1000 กรัม';
$g20_usage_rate = '10 กรัม ต่อน้ํา 20 ลิตร';
$g20_feature = 'ล็อคปาก :ทําให้เพลี้ยกระโดดสีน้ําตาลหยุดดูดน้ําเลี้ยงจากต้นข้าวภายใน 1-2 ชั่วโมง ป้องกันผลผลิต และลดปัญหาการเกิดโรคจู๋(เชื้อไวรัส) ล็อคขา :ทําลายขาหลังของเพลี้ยกระโดด ทําให้ไม่สามารถเกาะต้นข้าวได้ จึงไม่สามารถทําลายข้าวได้ ล็อคการวางไข่ : ทําให้เพลี้ยกระโดดหยุดการวางไข่ ไม่สามารถขยายพันธุ์ ลดการระบาดของเพลี้ยได้อย่างเด็ดขาด';
$g20_benefit = 'ใช้ป้องกันและกําจัดเพลี้ยกระโดดสีน้ําตาลในนาข้าว ประสิทธิภาพดีเยี่ยม 3 พลังล๊อค ห้ามกิน ห้ามเกาะและห้ามวางไข่ ทําให้เพลี้ยกระโดดสีน้ําตาลหยุดดูดน้ําเลี้ยงจากต้น ข้าวภายใน 1-2 ชั่วโมง ป้องกันผลผลิต และลดปัญหาการเกิดโรคจู๋ (เชื้อไวรัส)';
// กลุ่ม 21

$g21_group = '4A';
$g21_group_name = 'Neonicotinoids';
$g21_common_name = 'ไทอะมีทอกแซม (thiamethoxam) 25 % WG ลักษณะสาร : เม็ดสีน้ําตาลอ่อน';
$g21_substance_characteristics = 'เม็ดสีน้ําตาลอ่อน';
$g21_packing_size = '1000 กรัม';
$g21_usage_rate = ' - พ่นทางใบ ใช้อัตรา 10-20 กรัม ต่อน้ํา 20 ลิตร - แช่ท่อนพันธุ์มันสําปะหลังหรือจุ่มถาดเพาะกล้า ใช้อัตรา 10 กรัม ต่อน้ํา 20 ลิตร';
$g21_feature = 'เป็นสารในกลุ่ม neonicotinoids มีคุณสมบัติถูกตัวตาย กินตาย แทรกซึมผ่านใบและดูดซึม นอกจากนี้ยังดูดซึมทางรากหรือท่อน้ําและเคลื่อนย้ายในท่อน้ําจากล่างขึ้นบน กลไกออกฤทธิ์ต่อระบบประสาทตรงช่องว่างระหว่างเซลล์ประสาท โดยแย่งหรือแข่งกับสารสื่อประสาท Acetylcholines ในการจับกับตัวรับ nicotinic acetylcholine receptors ทําให้ส่งกระแสประสาทมากกว่าปกติและต่อมาตัวรับจะผิดรูปและทํางานไม่ได้';
$g21_benefit = 'ใช้ป้องกันกําจัดเพลี้ยไฟ เพลี้ยอ่อน เพลี้ยกระโดด แมลงหวี่ขาว เพลี้ยจักจั่นฝอย เพลี้ยจักจั่นฝ้าย เพลี้ยไก่แจ้ เพลี้ยแป้ง เพลี้ยหอย มวนเขียว มวนลําไย แมลงสิง ด้วงงวง ด้วงเต่าแตง หนอนชอนใบส้ม เป็นต้น';
// กลุ่ม 22

$g22_group = '4';
$g22_group_name = 'Pyridazinones';
$g22_common_name = 'ไพริดาเบน (pyridaben) 20% WP';
$g22_substance_characteristics = 'ผงสีขาวละเอียด';
$g22_packing_size = '1000 กรัม';
$g22_usage_rate = '10-20 กรัม ต่อน้ํา 20 ลิตร';
$g22_feature = 'เป็นสารในกลุ่ม pyridazinones มีคุณสมบัติถูกตัวตายและกินตาย กลไกออกฤทธิ์ต่อระบบหายใจเพื่อให้ได้พลังงานของแมลง โดยขัดขวางขบวนการรส่งผ่านอิเล็กตรอนในโปรตีน Complex 1 ใน Mitochondrial จึงส่งผลยับยั้งการสร้างพลังงาน ATP ของแมลงหรือไร ทําให้ขาดพลังงาน เป็นอัมพาตและตายในที่สุด สารออกฤทธิ์เร็ว กําจัดไรได้ทั้งระยะไข่ ตัวอ่อนและตัวเต็มวัย มีพิษข้างเคียงต่อเพลี้ยไฟ เพลี้ยจักจั่นบางชนิดและแมลงหวี่ขาวได้';
$g22_benefit = 'ใช้ป้องกันกําจัดไรศัตรูพืช เช่น ไรแดงแอฟริกัน ไรแดงมะม่วง ไรแดงกระเจี๊ยบ ไรแดงหม่อน ไรแดงชมพู ไรแดงชา ไรขาวพริก ไรกระเทียม ไรสนิมส้ม ไรกํามะหยี่ ไรเหลืองส้ม ไรสองจุด ไรปมพุทรา ไรแมงมุมคันซาวา ไรแมงมุมเผือก ไรแมงมุมเทียมกล้วยไม้ ไรแมงมุมฟิจิ โรแมงมุมเทียมปาล์ม ไรเขียวข้าว ไรกาบใบกล้วยไม้ ไรสี่ขา เป็นต้น';
// กลุ่ม 23

$g23_group = 'F3+C2';
$g23_group_name = 'โคลมาโซน (clomazone) 12% + โพรพานิล (propanil) 27% W/V EC';
$g23_common_name = 'โคลมาโซน (clomazone) 12% + โพรพานิล (propanil) 27% W/V EC';
$g23_substance_characteristics = '';
$g23_packing_size = '1000 มิลลิลิตร';
$g23_usage_rate = 'ข้าวนาหว่านน้ําตม ใช้อัตรา 350-400 มิลลิลิตร ต่อน้ํา 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หลังหว่านข้าว 7-12 วัน ก่อนพ่นต้องระบายน้ํา';
$g23_feature = 'ออกจากนา และทดน้ําเข้านาหลังพ่นสาร 2-3 วัน สารกําจัดวัชพืชในนาข้าวประเภทเลือกทําลาย ในกลุ่ม isoxazolidinones และ amides มีฤทธิ์ดูดซึมผ่านทางรากและยอดอ่อน เคลื่อนย้ายจากรากสู่ยอดอ่อนและฤทธิ์สัมผัสตาย ปลอดภัยต่อข้าวปลูก กลไกออกฤทธิ์ โคลมาโซน ยับยั้งการสร้างเม็ดสีของวัชพืช โดยขัดขวางการสังเคราะห์ DOXP ที่เกี่ยวข้องในการสังเคราะห์ด้วยแสง และ โพรพานิล ยับยั้งการสังเคราะห์ด้วยแสงของวัชพืช ในระบบแสง 2 (PS II) โดยขัดขวางการขนส่งอิเล็กตรอน ขัดขวางการตรึงคาร์บอนไดออกไซด์ การสร้างพลังงาน ATP และ NADPH2';
$g23_benefit = 'ใช้กําจัดวัชพืชหลังวัชพืชงอกในนาข้าวหว่านน้ําตม กําจัดวัชพืชประเภทใบแคบ เช่น หญ้าดอกขาว หญ้าข้าวนก หญ้านกสีชมพู หญ้าแดง และใบกว้างบางชนิด';


// แบ่งกลุ่ม วัชพืช 5 กลุ่ม

// กลุ่ม 1
$weed1_group = 'K3';
$weed1_group_name = 'สารกำจัดวัชพืช';
$weed1_common_name = 'บิวทาคลอร์ 60% W/V EC';
$weed1_substance_characteristics = 'ของเหลวสีน้าเงินม่วง';
$weed1_packing_size = '1000 มิลลิลิตร';
$weed1_usage_rate = '200-250 มิลลิลิตร ผสมน้ำ 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่';
$weed1_feature = 'สารกำจัดวัชพืชในนาข้าวประเภทเลือกทำลายในกลุ่ม chloroacetamides มีฤทธิ์ดูดซึม เข้าทำลายวัชพืชส่วนที่อยู่ใต้ดินละยอดอ่อนวัชพืชที่พึ่งงอก กลไกออกฤทธิ์ต่อส่วนปลายยอดอ่อนของวัชพืช ยับยั้งการสังเคราะห์กรด ไขมันสายยาว ส่งผลยับยั้งการแบ่งเซลล์ส่วนปลายยอดเจริญ ทั้งวัชพืช ที่โผล่พ้นดินและยังไม่โผล่พ้นดิน';
$weed1_benefit = 'ใช้กำจัดวัชพืชก่อนวัชพืชงอก และใช้หลังวัชพืชงอกระยะเริ่มต้นในนาข้าว หว่านน้าตม, ข้าวนาหว่านแห้ง, ข้าวไร่ กำจัดวัชพืชประเภทใบแคบ เช่น หญ้าแดง,หญ้าดอกขาว, หญ้าข้าวนก, หญ้านกสีชมพู, วัชพืชประเภทใบกว้าง เช่น ผักปอด, ขาเขียด, ผีกปลาบ และกก เช่น หนวดปลาดุก, แห้วหมู, กกขนาก, กกทราย, กกแดง, กกสามเหลี่ยม เป็นต้น';

// กลุ่ม 2
$weed2_group = 'K1';
$weed2_group_name = 'สารกำจัดวัชพืช';
$weed2_common_name = 'กลูโฟซิเนต-แอมโมเนียม';
$weed2_substance_characteristics = 'ของเหลวสีฟ้าใส';
$weed2_packing_size = '4 ลิตร';
$weed2_usage_rate = '- ใช้กำจัดวัชพืชที่มีความสูงไม่เกิน 30 ซม. ใช้อัตรา 600-800 มล. ต่อน้ำ 60-80 ลิตรพ่นบนพื้นที่ 1 ไร่ หรือ อัตรา 150-200 มล. ต่อน้ำ 15-20 ลิตร พ่นบน พื้นที่ 1 งาน<br>- วัชพืชข้ามปี ใช้อัตรา 1600-3200 มล. ผสมน้ำ 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หรืออัตรา 400-800 มล. ผสมน้า 15-20 ลิตร พ่นบนพื้นที่ 1 งาน';
$weed2_feature = 'สารกำจัดวัชพืชแบบเลือกทาลาย ในกลุ่ม dinitroanilines เป็นสารดูดซึมเข้าทางราก และใบวัชพืช ทาให้วัชพืชตายอย่างรวดเร็วแต่เริ่มงอกขณะโผล่พ้นผิวดิน กลไกออกฤทธิ์ต่อส่วนปลายรากของวัชพืช ยับยั้งการสังเคราะห์ กรดไขมันสายยาวส่งผลยับยั้งการแบ่งเซลล์และการยืดตัวของเซลล์ส่วนระบบราก ทำให้ต้นอ่อนวัชพืชชะงักการเจริญและตายก่อนโผล่พ้นดิน';
$weed2_benefit = 'ใช้กำจัดวัชพืชก่อนวัชพืชงอกและหลังวัชพืชงอกในระยะเริ่มต้นในอ้อย, กล้วย, สับปะรด, ข้าวโพด และส้ม กาจัดวัชพืชประเภทใบแคบ เช่น หญ้าตีนนก, หญ้าตีนกา, หญ้านกสีชมพู, หญ้าปากควาย, หญ้ารังนก และใบกว้าง เช่น ผักเบี้ยหิน, ผักเบี้ยใหญ่, ผักโขม, ผักโขมหนาม เป็นต้น';

// กลุ่ม 3
$weed3_group = 'K3';
$weed3_group_name = 'สารป้องกันกำจัดโรคพืช';
$weed3_common_name = 'อะซีโทคลอร์ 50% W/V EC';
$weed3_substance_characteristics = 'ของเหลวสีแดงใส';
$weed3_packing_size = '1000 มิลลิลิตร';
$weed3_usage_rate = '400-500 มิลลิลิตร ต่อน้ำ 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หรือ100-125 มิลลิลิตร ผสมน้ำ 15-20 ลิตร พ่นบนพื้นที่ 1 งาน';
$weed3_feature = 'สารกำจัดวัชพืชประเภทเลือกทำลายในกลุ่ม chloroacetamides มีฤทธิ์ดูดซึม กำจัดวัชพืชส่วนที่อยู่ใต้ดิน ยอดอ่อน ใช้คุมวัชพืชก่อนงอก นาน 4-6 สัปดาห์ ปลอดภัยต่อพืชปลูก กลไกออกฤทธิ์ต่อส่วนปลายยอดอ่อนของวัชพืช ยับยั้ง การสังเคราะห์กรดไขมันสายยาวส่งผลยับยั้งการแบ่งเซลล์ส่วนปลายยอดเจริญ ทั้งวัชพืชที่ โผล่พันดินละยังไม่โผล่พ้นดิน';
$weed3_benefit = 'ใช้คุมวัชพืชก่อนวัชพืชงอกในข้าวโพด, ถั่ว, อ้อย, มันฝรั่ง, มะเขือเทศ, พริก, หอม, กระเทียม, กระหล่ำปลี, ผักกาด, พืชผัก พืชสวนต่างๆ ใช้ควบคุม วัชพืชประเภทใบแคบ เช่น หญ้าตีนนก, หญ้ารังนก, หญ้าชันกาด, หญ้าขจรจบ, หญ้าตีนกา และหญ้าขน วัชพืชประเภทใบกว้าง เช่น สาบเสือ, สาบแร้ง, สาบกา, ไมยราบเลื้อย, เซ่งใบมน, หญ้ายาง, ผักเบี้ยใหญ่, ผักโขม, โสนหางไก่ เป็นต้น';

// กลุ่ม 4
$weed4_group = '1';
$weed4_group_name = 'สารป้องกันกำจัดโรคพืช';
$weed4_common_name = '2,4-ดี-ไดเมทิลแอมโมเนียม';
$weed4_substance_characteristics = 'ของเหลวสีใส';
$weed4_packing_size = '1000 มิลลิลิตร';
$weed4_usage_rate = 'ใช้อัตรา 160-180 มิลลิลิตร ผสมน้ำ 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หรืออัตรา 40-45 มิลลิลิตร <br>ผสมน้า 15-20 ลิตร พ่นบนพื้นที่ 1 งาน หลังหว่านข้าว 20 วันก่อนพ่นสารให้ระบายน้ำออก และทดน้ำเข้านาหลังพ่นสาร 2-3 วัน';
$weed4_feature = 'สารกำจัดวัชพืชในนาข้าวประเภทเลือกทำลาย ในกลุ่ม phenoxy-carboxylic acids มีฤทธิ์ดูดซึม ใช้ก่อนวัชพืชงอกและหลังวัชพืชงอก กลไกออกฤทธิ์ของ 2, 4-D เป็นสารควบคุมการเจริญเติบโตของพืช ที่ก่อให้เกิดความเป็นพิษต่อวัชพืช ทำให้ผนังเซลล์แข็งและหดตัวเมทาบอลิซึมกรดนิวคลีอิกลดลง การสังเคราะห์โปรตีนและการแบ่งเซลล์ผิดปกติ และกระตุ้นการสร้างเอทีลีน ส่งผลให้วัชพืชชะงักการเจริญเติบโต ใบหงิก เรียว ใบซีดเหลืองและตาย';
$weed4_benefit = 'ใช้หลังวัชพืชงอก ในข้าวนาหว่านน้ำตม เพื่อกาจัดวัชพืชประเภทใบกว้าง เช่น ผักปอดนา และเทียนนา และวัชพืชประเภทกก เช่น หนวดปลาดุก, กกขนาก และแห้วหมูนา';

// กลุ่ม 5
$weed5_group = 'G';
$weed5_group_name = 'สารกำจัดวัชพืช';
$weed5_common_name = 'ไกลโฟเซต-ไอโซโพรพิลแอมโมเนีย';
$weed5_substance_characteristics = 'ของเหลวสีฟ้าใส';
$weed5_packing_size = '4 ลิตร';
$weed5_usage_rate = '- วัชพืชข้ามปี ใช้อัตรา 500-1000 มิลลิลิตร ผสมน้ำ 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หรืออัตรา 125-250 มิลลิลิตร ผสมน้า 15-20 ลิตร พ่นบนพื้น ที่ 1 งาน <br>-วัชพืชทั่ว ไป ใช้อัตรา 500-600 มิลลิลิตร ผสมน้า 60-80 ลิตร พ่นบนพื้นที่ 1 ไร่ หรืออัตรา 125-150 มิลลิลิตร ผสมน้ำ 15-20 ลิตร พ่นบนพื้น ที่ 1 งาน หลังวัชพืชงอกมีความสูงไม่เกิน 30 เซนติเมตร';
$weed5_feature = 'เป็นสารกำจัดวัชพืชแบบไม่เลือกทำลาย ในกลุ่ม glycine derivative ออกฤทธิ์แบบดูดซึม โดยดูดซึมเข้าทางใบ และส่วนอื่นๆ ที่เกี่ยวข้องกับการสังเคราะห์แสง มีการเคลื่อนย้ายไปยังส่วนต่างๆของวัชพืช รวมทั้งรากเหง้าใต้ดิน กำจัดหญ้าได้ทุกชนิด';
$weed5_benefit = 'ใช้เพื่อกำจัดวัชพืชประเภทใบแคบ เช่น หญ้าตีนกา, หญ้าปากควาย, หญ้านกสีชมพู, หญ้ารังนก, หญ้าคา และหญ้าดอกขาว วัชพืชประเภทใบกว้าง เช่น กระดุมขน, บานไม่รู้โรยป่า, ตีนตุ๊กแก, หญ้าละออง, น้านมราชสีห์เล็ก, ผักเบี้ยใหญ่, ผักโขม และกะเม็ง และวัชพืชประเภทกก เช่น แห้วหมู';







// แบ่งกลุ่ม โรคพืช2กลุ่ม
// กลุ่ม 1
//gpd = group Plant Diseases
$plandiseases1_group = '1';
$plandiseases1_group_name = 'สารป้องกันกำจัดโรคพืช';
$plandiseases1_common_name = 'คาร์เบนดาซิม 50% W/V EC';
$plandiseases1_substance_characteristics = 'เนื้อครีมสีขาว';
$plandiseases1_packing_size = '1000 มิลลิลิตร';
$plandiseases1_usage_rate = '20-30 มิลลิลิตร ต่อน้ำ 20 ลิตร';
$plandiseases1_feature = 'เป็นสารกลุ่ม benzimidazoles มีคุณสมบัติเป็นสารดูดซึมและเคลื่อนย้าย ในต้นพืชมีฤทธิ์ครอบคลุมเชื้อโรคกว้างขวาง ยับยั้งการสร้างและพัฒนาเส้นใยของเชื้อรา กลไกออกฤทธิ์ย ับยั้งการแบ่งเซลล์แบบไม่อาศัยเพศ โดยขัดขวางเอนไซม์แอพเพรสซอเรียมที่ช่วยพัฒนาเส้นใยของเชื้อรา ทาให้สายโครโมโซม ที่แยกออกจากกันในขั้นตอนการแบ่งเซลล์แบบไม่อาศัยเพศไม่สามารถกลับมารวมกลุ่มที่บริเวณเบตา-ทูบูลินได้ และอาจยับยั้งการสังเคราะห์ วิตามิน บี12 ของเชื้อราบางชนิด';
$plandiseases1_benefit = 'ใช้ป้องกันกาจัดโรคพืช เช่น โรคแอนแทรคโนส, โรคใบจุดตากบ, โรคใบจุดสีม่วง, โรคต้นไหม้แห้งหน่อไม้ฝรั่ง, โรคใบจุดหน่อไม้ฝรั่ง, โรคราแป้ง, โรคราสนิม, โรคราสนิมขาว, โรคราเขม่า, โรคใบไหม้, โรคสแคป, โรคเมลาโนส, โรคใบจุดตานกในสตรอว์เบอร์รี่ เป็นต้น';
// กลุ่ม 2
$plandiseases2_group = '4';
$plandiseases2_group_name = 'สารป้องกันกำจัดโรคพืช';
$plandiseases2_common_name = 'เมทาแลกซิล (metalaxyl) 35% DS';
$plandiseases2_substance_characteristics = 'ผงละเอียดสีชมพูเข้ม';
$plandiseases2_packing_size = '1000 กรัม';
$plandiseases2_usage_rate = '25-50 กรัม ต่อน้ำ 20 ลิตร หรือ คลุกกับเมล็ดพันธุ์ 7 กรัม ต่อ เมล็ด 1 กิโลกรัม';
$plandiseases2_feature = 'เป็นสารในกลุ่ม acylalanines มีคุณสมบัติเป็นสารดูดซึม ยับยั้ง เส้นใย และการงอกของสปอร์เชื้อรา เนื้อละเอียด ละลายน้าดี ไม่อุดตันหัวฉีด เคลือบติดผิวใบพืชได้ดี ทนทานต่อการชะล้าง สามารถนาไปคลุกเมล็ดพันธุ์พืชได้ กลไกออกฤทธิ์ย ับยั้งขบวนการสังเคราะห์กรดนิวคลีอิค โดยขัดขวางการทางานของเอนไซม์ RNA polymerases 1';
$plandiseases2_benefit = 'ใช้ป้องกันและกำจัดโรคพืช เช่น โรคใบไหม้ในมะเขือเทศ มันฝรั่ง, โรคใบจุดตาเสือเผือก, โรคผลเน่า ในเงาะ, โรคยอดเน่าต้นเน่าสับปะรด, โรคผลเน่ามะเขือเปราะ มะเขือพวง, โรครากเน่าโคนเน่าในทุเรียน ส้ม ส้มโอ มะละกอ, โรคเน่าดา, โรคยอดเน่าในกล้วยไม้ ที่มีสาเหตุเกิดจากเชื้อราไฟท็อปธอร่า โรคราน้าค้างในองุ่น ข้าวโพด หอม กระเทียม ถั่ว ถั่วแระ ถั่วฝักยาว กุหลาบ แตงกวา แตงโม เมล่อน เป็นต้น';





$product_insects_details = array(
    'insect1' => array(
        'product_name' => 'อะบาเมกติน น้ำใส',
        'group' => $g1_group,
        'group_name' => $g1_group_name,
        'common_name' => $g1_common_name,
        'substance_characteristics' => $g1_substance_characteristics,
        'packing_size' => $g1_packing_size,
        'usage_rate' => $g1_usage_rate,
        'feature' => $g1_feature,
        'benefit' => $g1_benefit,
    ),
    'insect2' => array(
        'product_name' => 'อะบาเมกติน น้ำใส',
        'group' => $g1_group,
        'group_name' => $g1_group_name,
        'common_name' => $g1_common_name,
        'substance_characteristics' => $g1_substance_characteristics,
        'packing_size' => $g1_packing_size,
        'usage_rate' => $g1_usage_rate,
        'feature' => $g1_feature,
        'benefit' => $g1_benefit,
    ),
    'insect3' => array(
        'product_name' => 'อะบาเมกติน น้ำข้น',
        'group' => $g2_group,
        'group_name' => $g2_group_name,
        'common_name' => $g2_common_name,
        'substance_characteristics' => $g2_substance_characteristics,
        'packing_size' => $g2_packing_size,
        'usage_rate' => $g2_usage_rate,
        'feature' => $g2_feature,
        'benefit' => $g2_benefit,
    ),
    'insect4' => array(
        'product_name' => 'อะบาเมกติน น้ำข้น',
        'group' => $g2_group,
        'group_name' => $g2_group_name,
        'common_name' => $g2_common_name,
        'substance_characteristics' => $g2_substance_characteristics,
        'packing_size' => $g2_packing_size,
        'usage_rate' => $g2_usage_rate,
        'feature' => $g2_feature,
        'benefit' => $g2_benefit,
    ),
    'insect5' => array(
        'product_name' => 'อีมาเมกติน เบนโซเอต อีซี',
        'group' => $g3_group,
        'group_name' => $g3_group_name,
        'common_name' => $g3_common_name,
        'substance_characteristics' => $g3_substance_characteristics,
        'packing_size' => $g3_packing_size,
        'usage_rate' => $g3_usage_rate,
        'feature' => $g3_feature,
        'benefit' => $g3_benefit,
    ),
    'insect6' => array(
        'product_name' => 'ทีแม็กติน',
        'group' => $g3_group,
        'group_name' => $g3_group_name,
        'common_name' => $g3_common_name,
        'substance_characteristics' => $g3_substance_characteristics,
        'packing_size' => $g3_packing_size,
        'usage_rate' => $g3_usage_rate,
        'feature' => $g3_feature,
        'benefit' => $g3_benefit,
    ),
    'insect7' => array(
        'product_name' => 'รีคอลแม็ก',
        'group' => $g3_group,
        'group_name' => $g3_group_name,
        'common_name' => $g3_common_name,
        'substance_characteristics' => $g3_substance_characteristics,
        'packing_size' => $g3_packing_size,
        'usage_rate' => $g3_usage_rate,
        'feature' => $g3_feature,
        'benefit' => $g3_benefit,
    ),
    'insect8' => array(
        'product_name' => 'อามาแมกตินเบนโซเอต อีซี',
        'group' => $g3_group,
        'group_name' => $g3_group_name,
        'common_name' => $g3_common_name,
        'substance_characteristics' => $g3_substance_characteristics,
        'packing_size' => $g3_packing_size,
        'usage_rate' => $g3_usage_rate,
        'feature' => $g3_feature,
        'benefit' => $g3_benefit,
    ),
    'insect9' => array(
        'product_name' => 'ทีแม็กติน',
        'group' => $g3_group,
        'group_name' => $g3_group_name,
        'common_name' => $g3_common_name,
        'substance_characteristics' => $g3_substance_characteristics,
        'packing_size' => $g3_packing_size,
        'usage_rate' => $g3_usage_rate,
        'feature' => $g3_feature,
        'benefit' => $g3_benefit,
    ),
    'insect10' => array(
        'product_name' => 'ไซเพอร์เมทริน',
        'group' => $g4_group,
        'group_name' => $g4_group_name,
        'common_name' => $g4_common_name,
        'substance_characteristics' => $g4_substance_characteristics,
        'packing_size' => $g4_packing_size,
        'usage_rate' => $g4_usage_rate,
        'feature' => $g4_feature,
        'benefit' => $g4_benefit,
    ),
    'insect11' => array(
        'product_name' => 'แอร์บัต 35',
        'group' => $g4_group,
        'group_name' => $g4_group_name,
        'common_name' => $g4_common_name,
        'substance_characteristics' => $g4_substance_characteristics,
        'packing_size' => $g4_packing_size,
        'usage_rate' => $g4_usage_rate,
        'feature' => $g4_feature,
        'benefit' => $g4_benefit,
    ),
    'insect12' => array(
        'product_name' => 'ไซเพอร์เมทริน',
        'group' => $g4_group,
        'group_name' => $g4_group_name,
        'common_name' => $g4_common_name,
        'substance_characteristics' => $g4_substance_characteristics,
        'packing_size' => $g4_packing_size,
        'usage_rate' => $g4_usage_rate,
        'feature' => $g4_feature,
        'benefit' => $g4_benefit,
    ),
    'insect13' => array(
        'product_name' => 'โบอิ้ง 35',
        'group' => $g4_group,
        'group_name' => $g4_group_name,
        'common_name' => $g4_common_name,
        'substance_characteristics' => $g4_substance_characteristics,
        'packing_size' => $g4_packing_size,
        'usage_rate' => $g4_usage_rate,
        'feature' => $g4_feature,
        'benefit' => $g4_benefit,
    ),
    'insect14' => array(
        'product_name' => 'ทีเด็นบัต 35',
        'group' => $g4_group,
        'group_name' => $g4_group_name,
        'common_name' => $g4_common_name,
        'substance_characteristics' => $g4_substance_characteristics,
        'packing_size' => $g4_packing_size,
        'usage_rate' => $g4_usage_rate,
        'feature' => $g4_feature,
        'benefit' => $g4_benefit,
    ),
    'insect15' => array(
        'product_name' => 'โบอิ้ง 10',
        'group' => $g5_group,
        'group_name' => $g5_group_name,
        'common_name' => $g5_common_name,
        'substance_characteristics' => $g5_substance_characteristics,
        'packing_size' => $g5_packing_size,
        'usage_rate' => $g5_usage_rate,
        'feature' => $g5_feature,
        'benefit' => $g5_benefit,
    ),
    'insect16' => array(
        'product_name' => 'ฟิโพรนิล 5 เอสซี',
        'group' => $g6_group,
        'group_name' => $g6_group_name,
        'common_name' => $g6_common_name,
        'substance_characteristics' => $g6_substance_characteristics,
        'packing_size' => $g6_packing_size,
        'usage_rate' => $g6_usage_rate,
        'feature' => $g6_feature,
        'benefit' => $g6_benefit,
    ),
    'insect17' => array(
        'product_name' => 'ทีโปรเซนต์',
        'group' => $g6_group,
        'group_name' => $g6_group_name,
        'common_name' => $g6_common_name,
        'substance_characteristics' => $g6_substance_characteristics,
        'packing_size' => $g6_packing_size,
        'usage_rate' => $g6_usage_rate,
        'feature' => $g6_feature,
        'benefit' => $g6_benefit,
    ),
    'insect18' => array(
        'product_name' => 'ทีโพรนิล 5',
        'group' => $g6_group,
        'group_name' => $g6_group_name,
        'common_name' => $g6_common_name,
        'substance_characteristics' => $g6_substance_characteristics,
        'packing_size' => $g6_packing_size,
        'usage_rate' => $g6_usage_rate,
        'feature' => $g6_feature,
        'benefit' => $g6_benefit,
    ),
    'insect19' => array(
        'product_name' => 'ทีโบเซ็นต์',
        'group' => $g6_group,
        'group_name' => $g6_group_name,
        'common_name' => $g6_common_name,
        'substance_characteristics' => $g6_substance_characteristics,
        'packing_size' => $g6_packing_size,
        'usage_rate' => $g6_usage_rate,
        'feature' => $g6_feature,
        'benefit' => $g6_benefit,
    ),
    'insect20' => array(
        'product_name' => 'ทีโปรนิล 10',
        'group' => $g7_group,
        'group_name' => $g7_group_name,
        'common_name' => $g7_common_name,
        'substance_characteristics' => $g7_substance_characteristics,
        'packing_size' => $g7_packing_size,
        'usage_rate' => $g7_usage_rate,
        'feature' => $g7_feature,
        'benefit' => $g7_benefit,
    ),
    'insect21' => array(
        'product_name' => 'ฮาโลซัน',
        'group' => $g8_group,
        'group_name' => $g8_group_name,
        'common_name' => $g8_common_name,
        'substance_characteristics' => $g8_substance_characteristics,
        'packing_size' => $g8_packing_size,
        'usage_rate' => $g8_usage_rate,
        'feature' => $g8_feature,
        'benefit' => $g8_benefit,
    ),
    'insect22' => array(
        'product_name' => 'ฮาโลซัน 5',
        'group' => $g9_group,
        'group_name' => $g9_group_name,
        'common_name' => $g9_common_name,
        'substance_characteristics' => $g9_substance_characteristics,
        'packing_size' => $g9_packing_size,
        'usage_rate' => $g9_usage_rate,
        'feature' => $g9_feature,
        'benefit' => $g9_benefit,
    ),
    'insect23' => array(
        'product_name' => 'ทีเอ็นคลอพริด 10',
        'group' => $g10_group,
        'group_name' => $g10_group_name,
        'common_name' => $g10_common_name,
        'substance_characteristics' => $g10_substance_characteristics,
        'packing_size' => $g10_packing_size,
        'usage_rate' => $g10_usage_rate,
        'feature' => $g10_feature,
        'benefit' => $g10_benefit,
    ),
    'insect24' => array(
        'product_name' => 'อิมิดาโคลพริด อีซี',
        'group' => $g10_group,
        'group_name' => $g10_group_name,
        'common_name' => $g10_common_name,
        'substance_characteristics' => $g10_substance_characteristics,
        'packing_size' => $g10_packing_size,
        'usage_rate' => $g10_usage_rate,
        'feature' => $g10_feature,
        'benefit' => $g10_benefit,
    ),
    'insect25' => array(
        'product_name' => 'ทีแม็ก 5',
        'group' => $g11_group,
        'group_name' => $g11_group_name,
        'common_name' => $g11_common_name,
        'substance_characteristics' => $g11_substance_characteristics,
        'packing_size' => $g11_packing_size,
        'usage_rate' => $g11_usage_rate,
        'feature' => $g11_feature,
        'benefit' => $g11_benefit,
    ),
    'insect26' => array(
        'product_name' => 'อิมิดาโคลพริด 70',
        'group' => $g12_group,
        'group_name' => $g12_group_name,
        'common_name' => $g12_common_name,
        'substance_characteristics' => $g12_substance_characteristics,
        'packing_size' => $g12_packing_size,
        'usage_rate' => $g12_usage_rate,
        'feature' => $g12_feature,
        'benefit' => $g12_benefit,
    ),
    'insect27' => array(
        'product_name' => 'โพฟีโนฟอส',
        'group' => $g13_group,
        'group_name' => $g13_group_name,
        'common_name' => $g13_common_name,
        'substance_characteristics' => $g13_substance_characteristics,
        'packing_size' => $g13_packing_size,
        'usage_rate' => $g13_usage_rate,
        'feature' => $g13_feature,
        'benefit' => $g13_benefit,
    ),
    'insect28' => array(
        'product_name' => 'โพรคลอราช 45',
        'group' => $g14_group,
        'group_name' => $g14_group_name,
        'common_name' => $g14_common_name,
        'substance_characteristics' => $g14_substance_characteristics,
        'packing_size' => $g14_packing_size,
        'usage_rate' => $g14_usage_rate,
        'feature' => $g14_feature,
        'benefit' => $g14_benefit,
    ),
    'insect29' => array(
        'product_name' => 'โพรคลอราช 45',
        'group' => $g14_group,
        'group_name' => $g14_group_name,
        'common_name' => $g14_common_name,
        'substance_characteristics' => $g14_substance_characteristics,
        'packing_size' => $g14_packing_size,
        'usage_rate' => $g14_usage_rate,
        'feature' => $g14_feature,
        'benefit' => $g14_benefit,
    ),
    'insect30' => array(
        'product_name' => 'โพรพาร์ไภต์',
        'group' => $g15_group,
        'group_name' => $g15_group_name,
        'common_name' => $g15_common_name,
        'substance_characteristics' => $g15_substance_characteristics,
        'packing_size' => $g15_packing_size,
        'usage_rate' => $g15_usage_rate,
        'feature' => $g15_feature,
        'benefit' => $g15_benefit,
    ),
    'insect31' => array(
        'product_name' => 'ทีเอ็นมิพริด 3',
        'group' => $g16_group,
        'group_name' => $g16_group_name,
        'common_name' => $g16_common_name,
        'substance_characteristics' => $g16_substance_characteristics,
        'packing_size' => $g16_packing_size,
        'usage_rate' => $g16_usage_rate,
        'feature' => $g16_feature,
        'benefit' => $g16_benefit,
    ),
    'insect32' => array(
        'product_name' => 'เพรทิลาคลอร์',
        'group' => $g17_group,
        'group_name' => $g17_group_name,
        'common_name' => $g17_common_name,
        'substance_characteristics' => $g17_substance_characteristics,
        'packing_size' => $g17_packing_size,
        'usage_rate' => $g17_usage_rate,
        'feature' => $g17_feature,
        'benefit' => $g17_benefit,
    ),
    'insect33' => array(
        'product_name' => 'ไวต์ออยล์',
        'group' => $g18_group,
        'group_name' => $g18_group_name,
        'common_name' => $g18_common_name,
        'substance_characteristics' => $g18_substance_characteristics,
        'packing_size' => $g18_packing_size,
        'usage_rate' => $g18_usage_rate,
        'feature' => $g18_feature,
        'benefit' => $g18_benefit,
    ),
    'insect34' => array(
        'product_name' => 'ใบเฟริน 10',
        'group' => $g19_group,
        'group_name' => $g19_group_name,
        'common_name' => $g19_common_name,
        'substance_characteristics' => $g19_substance_characteristics,
        'packing_size' => $g19_packing_size,
        'usage_rate' => $g19_usage_rate,
        'feature' => $g19_feature,
        'benefit' => $g19_benefit,
    ),
    'insect35' => array(
        'product_name' => 'โพมีโทรซีน',
        'group' => $g20_group,
        'group_name' => $g20_group_name,
        'common_name' => $g20_common_name,
        'substance_characteristics' => $g20_substance_characteristics,
        'packing_size' => $g20_packing_size,
        'usage_rate' => $g20_usage_rate,
        'feature' => $g20_feature,
        'benefit' => $g20_benefit,
    ),
    'insect36' => array(
        'product_name' => 'ไทอะมีทอกแซม',
        'group' => $g21_group,
        'group_name' => $g21_group_name,
        'common_name' => $g21_common_name,
        'substance_characteristics' => $g21_substance_characteristics,
        'packing_size' => $g21_packing_size,
        'usage_rate' => $g21_usage_rate,
        'feature' => $g21_feature,
        'benefit' => $g21_benefit,
    ),
    'insect37' => array(
        'product_name' => 'ไพริดาเบน 20',
        'group' => $g22_group,
        'group_name' => $g22_group_name,
        'common_name' => $g22_common_name,
        'substance_characteristics' => $g22_substance_characteristics,
        'packing_size' => $g22_packing_size,
        'usage_rate' => $g22_usage_rate,
        'feature' => $g22_feature,
        'benefit' => $g22_benefit,
    )


);
$product_weeds_details = array(
    'weed1' => array(
        'product_name' => 'บิวทาคลอร์ 60% W/V EC',
        'group' => $weed1_group,
        'group_name' => $weed1_group_name,
        'common_name' => $weed1_common_name,
        'substance_characteristics' => $weed1_substance_characteristics,
        'packing_size' => $weed1_packing_size,
        'usage_rate' =>  $weed1_usage_rate,
        'feature' => $weed1_feature,
        'benefit' => $weed1_benefit
    ),
    'weed2' => array(
        'product_name' => 'บาบูคลอร์',
        'group' => $weed1_group,
        'group_name' => $weed1_group_name,
        'common_name' => $weed1_common_name,
        'substance_characteristics' => $weed1_substance_characteristics,
        'packing_size' => $weed1_packing_size,
        'usage_rate' =>  $weed1_usage_rate,
        'feature' => $weed1_feature,
        'benefit' => $weed1_benefit 
    ),
    'weed3' => array(
        'product_name' => 'ทีเอ็นทาคลอร์',
        'group' => $weed1_group,
        'group_name' => $weed1_group_name,
        'common_name' => $weed1_common_name,
        'substance_characteristics' => $weed1_substance_characteristics,
        'packing_size' => $weed1_packing_size,
        'usage_rate' =>  $weed1_usage_rate,
        'feature' => $weed1_feature,
        'benefit' => $weed1_benefit
    ),
    'weed4' => array(
        'product_name' => 'กลูโฟซิเนต-แอมโมเนียม',
        'group' => $weed2_group,
        'group_name' => $weed2_group_name,
        'common_name' => $weed2_common_name,
        'substance_characteristics' => $weed2_substance_characteristics,
        'packing_size' => $weed2_packing_size,
        'usage_rate' =>  $weed2_usage_rate,
        'feature' => $weed2_feature,
        'benefit' => $weed2_benefit
    ),
    'weed5' => array(
        'product_name' => 'อะซีโทคลอร์',
        'group' => $weed3_group,
        'group_name' => $weed3_group_name,
        'common_name' => $weed3_common_name,
        'substance_characteristics' => $weed3_substance_characteristics,
        'packing_size' => $weed3_packing_size,
        'usage_rate' =>  $weed3_usage_rate,
        'feature' => $weed3_feature,
        'benefit' => $weed3_benefit
    ),
    'weed6' => array(
        'product_name' => 'เมเบิ้ลโทคลอร์',
        'group' => $weed3_group,
        'group_name' => $weed3_group_name,
        'common_name' => $weed3_common_name,
        'substance_characteristics' => $weed3_substance_characteristics,
        'packing_size' => $weed3_packing_size,
        'usage_rate' =>  $weed3_usage_rate,
        'feature' => $weed3_feature,
        'benefit' => $weed3_benefit
    ),
    'weed7' => array(
        'product_name' => 'ทีเอ็นโทคลอร์',
        'group' => $weed3_group,
        'group_name' => $weed3_group_name,
        'common_name' => $weed3_common_name,
        'substance_characteristics' => $weed3_substance_characteristics,
        'packing_size' => $weed3_packing_size,
        'usage_rate' =>  $weed3_usage_rate,
        'feature' => $weed3_feature,
        'benefit' => $weed3_benefit
    ),
    'weed8' => array(
        'product_name' => '2,4-ดี-ไดเมทิลแอมโมเนียม',
        'group' => $weed4_group,
        'group_name' => $weed4_group_name,
        'common_name' => $weed4_common_name,
        'substance_characteristics' => $weed4_substance_characteristics,
        'packing_size' => $weed4_packing_size,
        'usage_rate' =>  $weed4_usage_rate,
        'feature' => $weed4_feature,
        'benefit' => $weed4_benefit
    ),
    'weed9' => array(
        'product_name' => 'ทีเอ็น โฟดี',
        'group' => $weed4_group,
        'group_name' => $weed4_group_name,
        'common_name' => $weed4_common_name,
        'substance_characteristics' => $weed4_substance_characteristics,
        'packing_size' => $weed4_packing_size,
        'usage_rate' =>  $weed4_usage_rate,
        'feature' => $weed4_feature,
        'benefit' => $weed4_benefit
    ),
    'weed10' => array(
        'product_name' => 'บาบูโซ-ดี',
        'group' => $weed4_group,
        'group_name' => $weed4_group_name,
        'common_name' => $weed4_common_name,
        'substance_characteristics' => $weed4_substance_characteristics,
        'packing_size' => $weed4_packing_size,
        'usage_rate' =>  $weed4_usage_rate,
        'feature' => $weed4_feature,
        'benefit' => $weed4_benefit
    ),
    'weed11' => array(
        'product_name' => 'ไกลโฟเซต-ไอโซโพรพิลแอมโมเนีย',
        'group' => $weed5_group,
        'group_name' => $weed5_group_name,
        'common_name' => $weed5_common_name,
        'substance_characteristics' => $weed5_substance_characteristics,
        'packing_size' => $weed5_packing_size,
        'usage_rate' =>  $weed5_usage_rate,
        'feature' => $weed5_feature,
        'benefit' => $weed5_benefit
    ),
);


$product_supplements_details = array(
    'supplement1' => array(
        'product_name' => 'ซุปเปอร์ ตายเรียบ',
        'group' => '4',
        'group_name' => 'สารอินทรีย์ เพิ่มฤทธิ์การฆ่าหญ้า',
        'common_name' => 'Super Potassium Humate',
        'substance_characteristics' => 'เกล็ดสีดำ',
        'packing_size' => '1000 กรัม',
        'usage_rate' => '- ใช้ซูปเปอร์ตายเรียบ 50 กรัม ต่อน้า 200 ลิตร, 100 กรัมต่อน้า 400 ลิตร<br>- ใช้ซูปเปอร์ตายเรียบ ผสมกับปุ๋ยหว่าน 1 กก. ต่อปุ๋ยเคมี 50 กก.',
        'feature' => 'สารกำจัดวัชพืชในนาข้าวประเภทเลือกทำลายในกลุ่ม chloroacetamides มีฤทธิ์ดูดซึม เข้าท่าลายวัชพืชส่วนที่อยู่ใต้ดินละยอดอ่อนวัชพืชที่พึ่งงอก กลไกออกฤทธิ์ต่อส่วนปลายยอดอ่อนของวัชพืช ยับยั้งการสังเคราะห์กรด ไขมันสายยาว ส่งผลยับยั้งการแบ่งเซลล์ส่วนปลายยอดเจริญ ทั้งวัชพืช ที่โผล่พ้นดินและยังไม่โผล่พ้นดิน',
        'benefit' => 'เพิ่มฤทธิ์สารกำจัดวัชพืช เช่น ไกลโฟเซต กลูโฟซิเนต อะทราซีน อะมีทรีน บิวทาคลอร์ อะซีโทคลอร์ เป็นต้น ไม่กลัวฝน เพราะดูดซึมได้รวดเร็ว สร้างรากใหม่ไว ระบบรากแข็งแรง ฟื้นต้นโทรม ให้พืชดูดปุ๋ยได้มาก ลดการใช้ปุ๋ย 30% 1กก. ผสมปุ๋ยได้ 50 กก. เพิ่มประสิทธิภาพในการดูดซึมของราก',
    ),
    'supplement2' => array(
        'product_name' => 'ซุปเปอร์ แตกกอ',
        'group' => '4',
        'group_name' => 'สารเพิ่มประสิทธิภาพ',
        'common_name' => 'Super Potassium Humate 95%',
        'substance_characteristics' => 'ผงละเอียดสีขาว',
        'packing_size' => '1000 กรัม',
        'usage_rate' => '5-10 กรัม ต่อน้า 20 ลิตร 100 กรัม ต่อน้า 200 ลิตร ต่อ 7 ไร่',
        'feature' => 'เป็นอินทรียวัตถุที่ละลายน้ำได้ดีและใช้ในการเพิ่มประสิทธิภาพพืช และสามารถทาละลายได้กับสารละลายชีวภาพบางชนิดเช่น แอลกอฮอล์ และกรดอินทรีย์ ค่าส่วนใหญ่จะเป็นกรดอ่อนๆ หรือด่างอ่อนๆ แล้วแต่ชนิดของผลิตภัณฑ์ โดยในผลิจภัณฑ์ซูปเปอร์ตายเรียบจะไม่มีความหนืด (Free flow) เพราะเป็นชนิดเกล็ด ขนาดของเกล็ด ประมาณ 2-4 มิลลิเมตรจะอยู่ในขนาดยิ่งขนาดเล็กคุณสมบัติ ในการละลายน้าจะสูงขนาดของพืชที่ผ ิวสัมผัสของรูปแบบเกล็ดคือ 30-60 ตารางเมตร/กรัม สามารถคงตัวได้ที่อุณหภูมิสูงกว่า 200 องศาเซลเซียส แต่ขึ้นกับปัจจัยอื่นๆ เช่น pH, ความเข้มข้น, และสสารอื่นๆ ที่รวมอยู่ในผลิตภัณฑ์ ค่าความหนาแน่นของ Super potassium Humate 1.3-1.5 g/cm3',
        'benefit' => 'Super Potassium Humate ประกอบขึ้นจากกรดฮิวมิกที่ มี ปริมาณอินทรีย์วัตถุจานวนมาก จากปริมาณของอินทรียวัตถุจึงเป็นแหล่งที่สะสมของธาตุโปแตสเซียม ที่สามารถใช้ในการปรับโครงสร้างของดิน โดยไม่จัดว่าเป็นปุ๋ย มีความสามารถในการละลายน้าสูง ง่ายต่อการใช้งาน มีความเข้ากันได้กับสารเคมีทั้งปุ๋ย, สารกาจัดแมลง, สารกาจัดวัชพืช เพื่อเพิ่มประสิทธิภาพสารเคมี Super Potassium Humate มีความสามารถในการกระตุ้นจุลชีพในดิน จากการที่ Super Potassium Humate เมื่อหลังจากการละลายน้ามีฤทธิ์เป็นกลางและช่วงปรับสภาพของการเป็นกรด-ด่างให้คงตัว หรืออาจจะเรียกได้ว่ามีคุณสมบัติของบัฟเฟอร์ Super Potassium Humate ช่วยในการเพิ่มอัตราการอุ้มน้าของดิน ลดต้องการน้าของพืช เพิ่มความทนทานของพืชในหน้าแล้ง จากคุณสมบัติของการเป็น Chelate ของ Potassium Humate มีความสามารถในการเป็นตัวพาทั้งสารเคมีและสารอาหารให้กับต้นพืช จากการเพิ่ม Chelate ของดิน จากการปรับคุณภาพของดิน ส่งผลให้เพิ่มประสิทธิภาพต่อการเจริญเติบโตต่อพืชโดยตรง และมีผลในการเพิ่มผลผลิต',
    ),
    'supplement3' => array(
        'product_name' => 'โฟล-อัพ',
        'group' => '1',
        'group_name' => 'สารอินทรีย์สกัดเข้มข้น',
        'common_name' => 'Humic Acid',
        'substance_characteristics' => 'ของเหลวสีดำ',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '5-10 ซีซี ต่อน้ำ 200 ลิตร',
        'feature' => 'เป็นหัวเชื้ออินทรีย์เข้มข้น ใช้ฉีดพ่นทางใบ ช่วยให้พืชเจริญอาหาร กระตุ้นให้รากพืชดูดกินปุ๋ยและสารอาหารในดินได้มากกว่าปกติ เมื่อผสมรวมกับปุ๋ยเกล็ด หรือปุ๋ยน้า ฉีดพ่นเป็นประจำจะทาให้พืช เจริญงอกงาม โตเร็ว แข็งแรง ใบมีสีเขียวสด ให้ผลดก มีคุณภาพดี ใช้ได้ดีกับ พืชผัก, พืชไร่, พืชสวน, ไม้ดอกไม้ประดับ และในนาข้าว',
        'benefit' => 'ก่อให้เกิดประโยชน์ต่อการเจริญเติบโตของพืช และคุณสมบัติของดิน เช่น -เพิ่มการอุ้มน้าของดิน -ช่วยยึดปุ๋ยไม่ให้ถูกชะล้างได้ง่าย และสามารถปลดปล่อยธาตุอาหารให้พืชเวลาที่พืชต้องการ -ป้องกันการพังทลายของดิน',
    ),
    'supplement4' => array(
        'product_name' => 'เมคอัพ',
        'group' => '1',
        'group_name' => 'สารอินทรีย์สกัดเข้มข้น',
        'common_name' => 'Humic Acid',
        'substance_characteristics' => 'ของเหลวสีดำ',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '5-10 ซีซี ต่อน้ำ 200 ลิตร',
        'feature' => 'เป็นหัวเชื้ออินทรีย์เข้มข้น ใช้ฉีดพ่นทางใบ ช่วยให้พืชเจริญอาหาร กระตุ้นให้รากพืชดูดกินปุ๋ยและสารอาหารในดินได้มากกว่าปกติ เมื่อผสมรวมกับปุ๋ยเกล็ด หรือปุ๋ยน้า ฉีดพ่นเป็นประจำจะทาให้พืช เจริญงอกงาม โตเร็ว แข็งแรง ใบมีสีเขียวสด ให้ผลดก มีคุณภาพดี ใช้ได้ดีกับ พืชผัก, พืชไร่, พืชสวน, ไม้ดอกไม้ประดับ และในนาข้าว',
        'benefit' => 'ก่อให้เกิดประโยชน์ต่อการเจริญเติบโตของพืช และคุณสมบัติของดิน เช่น -เพิ่มการอุ้มน้าของดิน -ช่วยยึดปุ๋ยไม่ให้ถูกชะล้างได้ง่าย และสามารถปลดปล่อยธาตุอาหารให้พืชเวลาที่พืชต้องการ -ป้องกันการพังทลายของดิน',
    ),
    'supplement5' => array(
        'product_name' => 'ทีเอ็นซิงค์',
        'group' => '1',
        'group_name' => 'ธาตุอาหารเสริม สังกะสี 5%',
        'common_name' => '-',
        'substance_characteristics' => 'ของเหลวสีน้ำตาลออกดำ',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '1-2 ลิตรของ TN Zinc /10,000 ตารางเมตร (เฮกตาร์) <br>160 มล.-320 มล. หรือ 150-300 มล. ต่อไร่<br>10-20 มิลลิลิตร / 20 ลิตร - 200 มิลลิลิตร / 200 ลิตร <br>20 ลิตรของสารผสม /2.4-3.6 ไร่ หรือ 2-4 ไร่',
        'feature' => 'สารสกัดจากสาหร่ายมีองค์ประกอบหลายชนิดที่ช่วยในการเจริญเติบโตของพืช รวมทั้งฮอร์โมนพืชคือไซโตไคนิน ที่ช่วยในการเพิ่มการเจริญเติบโต ของรากและออกซินที่ช ่วยในการเพิ่มการเจริญเติบโตของกิ่ง สารสกัดอะมิโนจากถั่วเหลืองมีองค์ประกอบที่ช ่วยให้พืชเจริญเติบโตหลายชนิดเช่นกัน และรวมไปถึง Zn DTPA (สังกะสีดีทีพีเอ) จะช่วยในการเสริมแร่ธาตุรองที่จ าเป็นเช่นสังกะสี ที่มีความสามารถในการเพิ่มการเจริญเติบโต และสร้างความแข็งแรงแก่ต้นพืช',
        'benefit' => 'Amino acid ในผลิตภัณฑ์ สามารถเป็นตัวช่วยเสริมการดูดซึมสารอาหารโดยตรง ที่รากพืชเพื่อเป็นตัวพาสารอาหารอื่นๆ ในดินได้และจากธาตุอาหารสังกะสี ก็ช่วยในการเร่งการดูดซึมสารอาหารได้ดียิ่งขึ้น ลดภาวะเครียดของพืช เพิ่มความแข็งแรงแก่พืช เพิ่มการพัฒนาราก เป็นแหล่งแร่ธาตุของสังกะสี และช่วยเพิ่มผลผลิต',
    ),
    'supplement6' => array(
        'product_name' => 'ทีเอ็นแคน',
        'group' => '1',
        'group_name' => 'ธาตุอาหารเสริม แคลเซียม 9%',
        'common_name' => '-',
        'substance_characteristics' => 'ของเหลวสีน้าตาลออกดำ',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '1-2 ลิตรของ TN Zinc /10,000 ตารางเมตร (เฮกตาร์) 160 มล.-320 มล. หรือ 150-300 มล. ต่อไร่ <br>10-20 มิลลิลิตร / 20 ลิตร - 200 มิลลิลิตร / 200 ลิตร<br>20 ลิตรของสารผสม /2.4-3.6 ไร่ หรือ 2-4 ไร่',
        'feature' => 'ธาตุอาหารไม่เพียงพอ หรือ ความไม่สมดุลของธาตุอาหาร ความสำคัญเสริมสร้างความแข็งแรงของเนื้อเยื่อและเซลล์ฟิชกระตุ้นการดูดซับธาตุอาหารของ ราก และการเคลื่อนที่ธาตุอาหารในพืช แคลเซียมเป็นธาตอาหารที่มีบทบาทสำคัญ เกี่ยวกับคุณภาพผลผลิตของพืชไม้ผลและพืชผักต่าง ๆ แคลเซียมช่วยยืดอายุการเก็บรักษาผลผลิต ทาให้การเน่าเบื่อช้าลง ความสำคัญของแคลเซียมต่อคุณภาพผลผลิตนับวันจะมีความสำคัญเพิ่มมากขึ้น เนื่องจากมีข้อมูลเพิ่มขึ้นเกี่ยวกับบทบาท ของ แคลเซียม ไม้ผล พืชผัก และไม้ดอกมีความต้องการแคลเซียมมากกว่าธัญพืช เช่นข้าวหรือข้าวโพด',
        'benefit' => 'เป็นโครงสร้างผนังเซลล์ของพืช ทำให้พืชมีความแข็งแรง และช่วยในการสร้างโปรตีน ช่วยขยายขนาดของผล และป้องกันไม่ให้ผลเถา หรือผักแตก ทาให้เนื้อแน่น ป้องกันแกนไส้นิ่ม รสชาติและสีดีขึ้น',
    ),
    'supplement7' => array(
        'product_name' => 'ทีเอ็นแม็กซ์',
        'group' => '1',
        'group_name' => 'ธาตุอาหารเสริม แมกนีเซียม 7%',
        'common_name' => '-',
        'substance_characteristics' => 'ของเหลวสีน้าตาลออกดำ',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '1-2 ลิตรของ TN Zinc /10,000 ตารางเมตร (เฮกตาร์) 160 มล.-320 มล. หรือ 150-300 มล. ต่อไร่<br>10-20 มิลลิลิตร / 20 ลิตร - 200 มิลลิลิตร / 200 ลิตร<br>20 ลิตรของสารผสม /2.4-3.6 ไร่ หรือ 2-4 ไร่',
        'feature' => 'ผลิตภัณฑ์ประกอบด้วยแร่ธาตุแมกนีเซียม ที่ช่วยพืชในการสังเคราะห์แสง การทางานของเอมไซม์ และสุขภาพโดยรวมของพืช สารสกัดจากสาหร่าย ช่วยในการเสริมแร่ธาตุและฮอร์โมนต่างๆ รวมไปถึงองค์ประกอบทางของสารชีวมวล เพิ่มความสามารถในการดูดซึมสารอาหารของพืชจากความสามารถของ Magnesium EDTA ที่สามารถนาแร่ธาตุแมกนีเซียมเข้าสู่พืชอย่างมีประสิทธิภาพ สารสกัดจากสาหร่าย และกรดอะมิโน ช่วยกระตุ้นการเจริญเติบโตของรากและช่วยในการเพิ่มการดูดซึมสารอาหาร',
        'benefit' => 'ในผลิตภัณฑ์มีส่วนผสมของ Magnesium chelate (Magnesium EDTA) ที่เป็นส่วนประกอบของอนุพันธ์ที่เสถียรของ แมกนีเซียมไอออน การที่อยู่ในรูป Chelate สามารถช่วยในการเพิ่มประสิทธิภาพการดูดซึมและการนำไปใช้ได้ดีมากขึ้น โดยพืชจะใช้ แมกนีเซียมในกระบวนการสังเคราะห์แสง การทำงานของเอนไซม์ เกี่ยวกับการสังเคราะห์โปรตีนและคาร์โบไฮเดรต กระบวนการถ่ายเทพลังงานที่เป็นส่วนประกอบของ ATP, กระบวนการขนย้ายแร่ธาตุ และการรักษาสมดุลของไอออนในเซลล์ของพืช และช่วยในการสร้างโครงสร้างของเซลล์พืชเช่นไรโบโซม และ DNA RNA',
    ),
    'supplement8' => array(
        'product_name' => 'เรนนี่',
        'group' => '1',
        'group_name' => 'สารจับใบ',
        'common_name' => 'คาร์เบนดาซิม 50% W/V EC',
        'substance_characteristics' => 'ของเหลวสีเหลืองอ่อน',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => 'ชนิดของสารเคมี ผสมน้ำ 20 ลิตร ยาฆ่าแมลง 15ซีซี.-30ซีซี. (1-2 ช้อนแกง) ยากาจัดวัชพืช 30ซีซี. (2 ช้อนแกง) ยากาจัดโรครา 15ซีซี.-30ซีซี. (1-2 ช้อนแกง) ปุ๋ยเกร็ด ปุ๋ยน้า ฮอร์โมน 30ซีซี. (2 ช้อนแกง)',
        'feature' => 'ช่วยในการผสมสารละลายที่ไม่สามารถเข้ากันได้เช่น น้าและน้ำมันจากคุณสมบัติของ อิมัลซิไฟเออร์ (Emulsifier) ปรับสภาพน้ำกระด้างได้ ปกป้องความเป็นพิษของยาคุมกับพืชประธาน มีความสามารถในการเพิ่มการกระจายตัวของสารเคมีบนใบพืช ความสามารถในการละลายน้ำและการกระจายตัวของสารเคมี ออกฤทธิ์นานกว่าแม้ในสภาพแล้ง ควบคุมวัชพืชทั้งก่อนงอกและหลังงอกในกลุ่มพืชไร่ได้ดีเยี่ยม',
        'benefit' => 'weed เช่น แมลงหวี่ขาว, เพลี้ย, จักจั่น , ไรแดง, เพลี้ยฝอย, หนอนใบขาว, หนอนกอ, หนอน, หนอนเจาะ, ผ่าดอก',
    ),
);

$product_hormones_details = array(
    'hormone1' => array(
        'product_name' => 'อีทีฟอน 52',
        'group' => '33',
        'group_name' => 'สารควบคุมการเจริญเติบโตของพืช',
        'common_name' => 'อีทีฟอน 52% W/V SL',
        'substance_characteristics' => 'ของเหลวน้ำใส',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '- บูมดอกสับปะรด หยอดยอดสับปะรด ใช้ในอัตรา 4-6 มิลลิลิตร ต่อน้า 20 ลิตร ครั้งที่ 1 สับปะรด อายุ 9-12 เดือน ครั้งที่ 2 หลังจากครั้งแรก 7 วัน ใช้น้าอัตรา 600 ลิตร ต่อไร่',
        'feature' => 'สารควบคุมการเจริญเติบโตของพืช มีคุณสมบัติควบคุมการสุกแก่ของพืช มีฤทธิ์แทรกซึมและเคลื่อนย้ายผ่านท่ออาหารไปยังส่วนเจริญของพืชได้ มีสมบัติเป็นกรดอ่อน ดังนั้นไม่ควรผสมน้าทิ้งไว้นานเกิน 24 ชั่วโมง และห้ามผสมกับน้ำที่มีความเป็นด่างจัด',
        'benefit' => '- ช่วยกระตุ้นการออกดอกในสับปะรด ให้ออกดอกพร้อมกันเพื่อสะดวกต่อการเก็บเกี่ยว - เร่งการสุกของผลไม้ เช่น ทุเรียน มะม่วง กล้วย<br>- ใช้เร่งการสุกในการเก็บเกี่ยวผลมะเขือเทศรอบสุดท้าย',
    ),
    'hormone2' => array(
        'product_name' => 'บีทีเท็กซ์',
        'group' => '33',
        'group_name' => 'สารควบคุมการเจริญเติบโตของพืช',
        'common_name' => 'อีทีฟอน 52% W/V SL',
        'substance_characteristics' => 'ของเหลวน้ำใส',
        'packing_size' => '1000 มิลลิลิตร',
        'usage_rate' => '- บูมดอกสับปะรด หยอดยอดสับปะรด ใช้ในอัตรา 4-6 มิลลิลิตร ต่อน้า 20 ลิตร ครั้งที่ 1 สับปะรด อายุ 9-12 เดือน ครั้งที่ 2 หลังจากครั้งแรก 7 วัน ใช้น้าอัตรา 600 ลิตร ต่อไร่',
        'feature' => 'สารควบคุมการเจริญเติบโตของพืช มีคุณสมบัติควบคุมการสุกแก่ของพืช มีฤทธิ์แทรกซึมและเคลื่อนย้ายผ่านท่ออาหารไปยังส่วนเจริญของพืชได้ มีสมบัติเป็นกรดอ่อน ดังนั้นไม่ควรผสมน้าทิ้งไว้นานเกิน 24 ชั่วโมง และห้ามผสมกับน้ำที่มีความเป็นด่างจัด',
        'benefit' => '- ช่วยกระตุ้นการออกดอกในสับปะรด ให้ออกดอกพร้อมกันเพื่อสะดวกต่อการเก็บเกี่ยว - เร่งการสุกของผลไม้ เช่น ทุเรียน มะม่วง กล้วย<br>- ใช้เร่งการสุกในการเก็บเกี่ยวผลมะเขือเทศรอบสุดท้าย',
    ),
    'hormone3' => array(
        'product_name' => 'แพคโคลบิวทราซอล',
        'group' => '3',
        'group_name' => 'สารควบคุมการเจริญเติบโตของพืช',
        'common_name' => 'แพกโคลบิวทราซอล 15% WP',
        'substance_characteristics' => 'ผงละเอียดสีขาว',
        'packing_size' => '1000 กรัม',
        'usage_rate' => 'ใช้อัตรา 6.5 กรัมต่อเส้นผ่านศูนย์กลางทรงพุ่ม 1 เมตรผสมน้ำ 5 ลิตร ราดบริเวณโคนต้นโดยห่างจาก โคนต้น 30 เซนติเมตรในระยะใบพวงหรือใบเพสลาด',
        'feature' => 'สารชะลอการเจริญเติบโตของพืชที่นิยมใช้กับมะม่วงและพืชไร่ และเป็นสารกาจัดเชื้อรากลุ่ม triazole ออกฤทธิ์ในทางตรงข้ามกับจิบเบอเรลลิน โดยยับยั้งการสังเคราะห์จิบเบอเรลลิน ลดการยืดตัวของปล้อง เพิ่มการเจริญเติบโตของราก เร่งให้เกิดดอก ทำให้ออกลูกเร็วและเพิ่มการผลิตเมล็ดในพืช',
        'benefit' => 'ใช้ในการจัดสวนเพื่อลดการเจริญเติบโตของยอด ใช้ได้ผลดีกับไม้พุ่มและไม้ต้น ช่วยเพิ่มความทนทานต่อความเครียดจากความแล้ง เกิดใบไม้สีเขียวเข้ม มีความต้านทานต่อเชื้อราและแบคทีเรียเพิ่มขึ้นและเพิ่มการพัฒนาของราก การเจริญของแคมเบียมเช่นเดียวกับการยับยั้งการเจริญของยอดในไม้ต้นบางชนิด',
    ),
);


$product_plantDiseases_details = array(
    'plantDisease1' => array(
        'product_name' => 'คาร์เบนดาซิม 50 เอสซี',
        'group' => $plandiseases1_group,
        'group_name' => $plandiseases1_group_name,
        'common_name' => $plandiseases1_common_name,
        'substance_characteristics' => $plandiseases1_substance_characteristics,
        'packing_size' => $plandiseases1_packing_size,
        'usage_rate' =>  $plandiseases1_usage_rate,
        'feature' => $plandiseases1_feature,
        'benefit' => $plandiseases1_benefit
    ),
    'plantDisease2' => array(
        'product_name' => 'คาร์วีติน เอสซี',
        'group' => $plandiseases1_group,
        'group_name' => $plandiseases1_group_name,
        'common_name' => $plandiseases1_common_name,
        'substance_characteristics' => $plandiseases1_substance_characteristics,
        'packing_size' => $plandiseases1_packing_size,
        'usage_rate' =>  $plandiseases1_usage_rate,
        'feature' => $plandiseases1_feature,
        'benefit' => $plandiseases1_benefit
    ),
    'plantDisease3' => array(
        'product_name' => 'พีวีติน',
        'group' => $plandiseases1_group,
        'group_name' => $plandiseases1_group_name,
        'common_name' => $plandiseases1_common_name,
        'substance_characteristics' => $plandiseases1_substance_characteristics,
        'packing_size' => $plandiseases1_packing_size,
        'usage_rate' =>  $plandiseases1_usage_rate,
        'feature' => $plandiseases1_feature,
        'benefit' => $plandiseases1_benefit
    ),
    'plantDisease4' => array(
        'product_name' => 'เมทาแลกซิล 35 (สีชมพู)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    ),
    'plantDisease5' => array(
        'product_name' => 'เมทาแลกซิล 35 (สีขาว)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    ),
    'plantDisease6' => array(
        'product_name' => 'พีซีพรอน 35 ดีเอส (สีขาว)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    ),
    'plantDisease7' => array(
        'product_name' => 'พีซีพรอน 35 ดีเอส (สีชมพู)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    ),
    'plantDisease8' => array(
        'product_name' => 'ครอบบา (สีชมพู)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    ),
    'plantDisease9' => array(
        'product_name' => 'ครอบบา (สีขาว)',
        'group' => $plandiseases2_group,
        'group_name' => $plandiseases2_group_name,
        'common_name' => $plandiseases2_common_name,
        'substance_characteristics' => $plandiseases2_substance_characteristics,
        'packing_size' => $plandiseases2_packing_size,
        'usage_rate' =>  $plandiseases2_usage_rate,
        'feature' => $plandiseases2_feature,
        'benefit' => $plandiseases2_benefit
    )
);


?>